Repository: ujnim/smarthome_101
Catalog: lib/l10n/intl_*.arb
Languages: th

# policy7
source: <b>7. To whom and in what cases may the Company disclose your personal data?</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.1 The Company will disclose or share all or some of your information in the following cases <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(1) Affiliated companies, affiliated companies, consultants, contractors, subcontractors, government officials and third parties who need to access the information to operate on the basis of the Company's services, where such persons have access to the necessary information. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(2) The Company will disclose information when requested in accordance with a reasonable basis under applicable law, court order or legal process, or any other requirement in connection with applicable law, court order or legal process. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(3) If the Company believes that your actions do not conform to the spirit or provision of the Terms and Conditions, or additional or amended Terms and Conditions, or any other agreement or policy of the Company, and the Company deems that disclosure of the information is reasonably necessary to enforce the Terms and Conditions or any agreement of the Company, or to protect its operations which may involve disclosure of information to the public or government agencies. In accordance with applicable law.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(4) If the Company believes that disclosing or sharing the information is to protect the rights, safety and property of you, the Company and a third party.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(5) When the Company enters into negotiations for a merger, sale of assets, financing proceedings, or sale of business, in which case the Company will request that the acquirer comply with the revised Policy as of the date on which the Company collects the information.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(6) When the Company has received your permission for your own purposes, such as when you allow a third party to become a member with the right to use the Service. The third party will know all or some of your information.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.2 The Company will require the recipient of the information to have appropriate measures to protect your information and process such personal information only as necessary and take steps to prevent other persons from using or disclosing personal information without authorization
th: <b>7. บริษัทฯอาจเปิดเผยข้อมูลส่วนบุคคลของท่านให้ใครบ้างและกรณีใด</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.1 บริษัทฯจะเปิดเผยหรือแบ่งปันข้อมูลฯทั้งหมดหรือบางส่วนของท่าน ในกรณีดังต่อไปนี้ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(1) บริษัทฯ ในเครือ บริษัทในกลุ่มพันธมิตร ที่ปรึกษา ผู้รับจ้าง ผู้รับจ้างช่วง เจ้าหน้าที่ของรัฐ และบุคคลที่สาม ที่จำเป็นต้องเข้าถึงข้อมูลฯเพื่อดำเนินงานบนพื้นฐานการให้บริการฯของบริษัทฯ ซึ่งบุคคลดังกล่าวสามารถเข้าถึงข้อมูลฯที่จำเป็น เฉพาะเท่าที่ต้องใช้เพื่อบรรลุวัตถุประสงค์การเก็บรวบรวมและประมวลผลข้อมูลส่วนบุคคลตามที่ระบุไว้ในนโยบายความเป็นส่วนตัวนี้เท่านั้น <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(2) บริษัทฯจะเปิดเผยข้อมูลเมื่อได้รับการร้องขอที่เชื่อได้ว่ามีความถูกต้องตามกฎหมายที่บังคับใช้ คำสั่งศาล หรือกระบวนการทางกฎหมาย หรือความต้องการอื่นใดที่เกี่ยวข้องกับกฎหมายที่บังคับใช้ คำสั่งศาล หรือกระบวนการทางกฎหมาย <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(3) หากบริษัทฯเชื่อว่าการกระทำของท่านไม่เป็นไปตามเจตนารมณ์หรือข้อตกลงที่ระบุในข้อกำหนดและเงื่อนไขฯ หรือข้อกำหนดและเงื่อนไขฯเพิ่มเติม หรือข้อกำหนดและเงื่อนไขฯที่เปลี่ยนแปลง หรือข้อตกลงอื่นใด หรือนโยบายฯ ของบริษัทฯ ที่เกี่ยวข้อง และบริษัทเห็นว่าการเปิดเผยข้อมูลฯ นั้นมีความจำเป็นตามสมควรต่อการบังคับใช้ข้อกำหนดและเงื่อนไขฯ หรือข้กตกลงใดๆ ของบริษัท หรือเพื่อปกป้องการดำเนินงานซึ่งอาจเป็นการเปิดเผยข้อมูลฯ ต่อสาธารณะหรือหน่วยงานของรัฐ โดยให้เป็นไปตามกฎหมายที่บังคับใช้ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(4) หากบริษัทฯเชื่อว่าการเปิดเผยหรือแบ่งปันข้อมูลฯเป็นไปเพื่อปกป้องสิทธิ์ ความปลอดภัย และทรัพย์สินของท่าน บริษัทฯ และบุคคลที่สาม<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(5) เมื่อบริษัทฯเข้าสู่กระบวนการเจรจาต่อรองเพื่อควบรวมกิจการ การขายทรัพย์สิน กระบวนการทางการเงิน การขายกิจการ โดยบริษัทฯ จะร้องขอให้ผู้ซื้อกิจการปฏิบัติตามนโยบายฯฉบับที่แก้ไข ณ วันที่บริษัทฯดำเนินการเก็บข้อมูลฯ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(6) เมื่อบริษัทฯได้รับอนุญาตจากท่านเพื่อให้เป็นไปตามวัตถุประสงค์ของท่านเอง เช่น การที่ท่านอนุญาตให้บุคคลที่สามเข้าเป็นสมาชิกที่มีสิทธิ์ร่วมใช้บริการฯ ซึ่งบุคคลที่สามนั้นจะทราบข้อมูลทั้งหมดหรือบางส่วนของท่านด้วย<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.2 บริษัทฯจะกำหนดให้ผู้ที่ได้รับข้อมูลฯ มีมาตรการปกป้องข้อมูลฯ ของท่านอย่างเหมาะสมและประมวลผลข้อมูลส่วนบุคคลดังกล่าวเท่าที่จำเป็นเท่านั้น และดำเนินการเพื่อป้องกันไม่ให้บุคคลอื่นใช้หรือเปิดเผยข้อมูลส่วนบุคคลโดยปราศจากอำนาจโดยมิชอบ

# policy8
source: <b>8. Does the Company send or transfer your personal data abroad?</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>8.1 The Company may forward some or all of your data to affiliated companies or third parties abroad where necessary for the performance of a contract to which you are a party, or for the performance of a contract between the Company and a third party for your benefit or for the purpose of taking action at your request prior to entering into a contract, or to prevent or suppress danger to the life, body or health of you or another person, to comply with the law, or where necessary to carry out important public interest missions.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>8.2 The Company may store your data on computer servers or clouds provided by third parties and may use third-party programs or applications in the form of Software as a Service (SaaS) and Platform as a Service (PaaS) to process your data. However, the Company will not allow unrelated persons to access personal data. and will require those other persons to have appropriate security measures in place.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>8.3 In the event that your personal data is transferred to a country, the Company will take appropriate measures to ensure that your data is protected and that you can exercise your rights related to your data in accordance with the law, including requiring those who receive the data to have appropriate measures to protect your data and to process such data only to the extent necessary and to take steps to prevent others from using or disclosing the data without authorization without permission
th: <b>8. บริษัทฯส่งหรือโอนข้อมูลส่วนบุคคลของท่านไปต่างประเทศหรือไม่</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>8.1 บริษัทฯอาจส่งต่อข้อมูลฯของท่านบางส่วนหรือทั้งหมด ไปยังบริษัทในเครือหรือบุคคลที่สามในต่างประเทศ ในกรณีที่จำเป็นเพื่อการปฏิบัติตามสัญญาซึ่งท่านเป็นคู่สัญญา หรือเป็นการกระทำตามสัญญาระหว่างบริษัทฯ กับบุคคลที่สามเพื่อประโยชน์ของท่านหรือเพื่อใช้ในการดำเนินการตามคำขอของท่านก่อนเข้าทำสัญญา หรือเพื่อป้องกันหรือระงับอันตรายต่อชีวิต ร่างกาย หรือสุขภาพของท่านหรือบุคคลอื่น เพื่อปฏิบัติตามกฎหมาย หรือเป็นการจำเป็นเพื่อดำเนินภารกิจเพื่อประโยชน์สาธารณะที่สำคัญ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>8.2 บริษัทฯอาจเก็บข้อมูลฯของท่านบนคอมพิวเตอร์เซิร์ฟเวอร์หรือคลาวด์ที่ให้บริการโดยบุคคลที่สามและอาจใช้โปรแกรมหรือแอปพลิเคชันของบุคคลที่สามในรูปแบบของ Software as a Service (SaaS) และ Platform as a Service (PaaS) ในการประมวลผลข้อมูลฯของท่าน แต่บริษัทฯจะไม่อนุญาตให้บุคคลที่ไม่เกี่ยวข้องสามารถเข้าถึงข้อมูลส่วนบุคคลได้ และจะกำหนดให้บุคคลอื่นเหล่านั้นต้องมีมาตรการคุ้มครองความมั่นคงปลอดภัยที่เหมาะสม <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>8.3 ในกรณีที่มีการส่งข้อมูลส่วนบุคคลของท่านไปยังประเทศ บริษัทฯจะใช้มาตรการที่เหมาะสมเพื่อทำให้มั่นใจได้ว่าข้อมูลฯท่านจะได้รับการคุ้มครองและท่านสามารถใช้สิทธิที่เกี่ยวข้องกับข้อมูลฯของท่านได้ตามกฎหมาย รวมถึงบริษัทฯจะกำหนดให้ผู้ที่ได้รับข้อมูลมีมาตรการปกป้องข้อมูลฯของท่านอย่างเหมาะสมและประมวลผลข้อมูลฯดังกล่าวเท่าที่จำเป็นเท่านั้น และดำเนินการเพื่อป้องกันไม่ให้บุคคลอื่นใช้หรือเปิดเผยข้อมูลฯโดยปราศจากอำนาจโดยมิชอบ

# policy9
source: <b>9. Security measures for your information</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.1 The Company places importance on the security of your information. The Company has implemented appropriate technical and administrative security measures to protect and prevent your information from loss, unauthorized access, use or disclosure by unauthorized persons or unlawful means, misuse, alteration, modification and destruction by using security technologies and procedures such as encryption and access restrictions to ensure that only authorized persons have access to your information and that these persons have been trained on the importance of protecting personal data. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.2 The Company has appropriate security measures in place to prevent the loss, access, use, alteration, modification, disclosure of personal data from persons who have no rights or duties related to that personal data. And will review such measures when necessary or when technology changes to ensure appropriate security efficiency.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>Although the Company has measures to maintain data security in any way, the Company would like you to be aware that no method can completely secure the transmission of data or storage of data via the Internet or electronic systems. Therefore, the Company cannot guarantee the security of data during transmission or storage into the Company's system. In order to help protect your privacy rights and data protection, the Company needs to ask for your cooperation by not disclosing your username, password or data to other persons or using the same password for other online services. In the event that you suspect that there has been unauthorized access or use of your account or any breach of the security system, please notify the Company as soon as possible to take corrective action.
th: <b>9. มาตรการรักษาความปลอดภัยให้ข้อมูลฯของท่าน</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.1 บริษัทฯให้ความสำคัญกับความปลอดภัยของข้อมูลฯของท่าน บริษัทฯจึงได้นำมาตรฐานความปลอดภัยทางเทคนิคและการบริหารที่เหมาะสมมาใช้เพื่อปกป้องและป้องกันข้อมูลฯจากการสูญหาย การเข้าถึง การใช้ หรือการเปิดเผยโดยไม่ได้รับอนุญาตหรือความยินยอมโดยผู้ที่ไม่มีสิทธิหรือโดยมิชอบด้วยกฎหมาย การใช้งานในทางที่ผิด การดัดแปลง เปลี่ยนแปลง และการทำลายโดยใช้เทคโนโลยีและขั้นตอนการรักษาความปลอดภัย เช่น การเข้ารหัสและการจำกัดการเข้าถึง เพื่อให้มั่นใจว่าบุคคลที่ได้รับอนุญาตเท่านั้นที่เข้าถึงข้อมูลฯของท่านและบุคคลเหล่านี้ได้รับการฝึกอบรมเกี่ยวกับความสำคัญของการปกป้องข้อมูลส่วนบุคคล <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.2 บริษัทฯจัดให้มีมาตรการรักษาความปลอดภัยที่เหมาะสม เพื่อป้องกันการสูญหาย เข้าถึง ใช้ เปลี่ยนแปลง แก้ไข เปิดเผยข้อมูลส่วนบุคคลจากผู้ที่ไม่มีสิทธิหรือหน้าที่ที่เกี่ยวข้องกับข้อมูลส่วนบุคคลนั้น และจะจัดให้มีการทบทวนมาตรการดังกล่าวเมื่อมีความจำเป็นหรือเมื่อเทคโนโลยีเปลี่ยนแปลงไปเพื่อให้มีประสิทธิภาพในการรักษาความปลอดภัยที่เหมาะสม<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>แม้ว่าบริษัทฯจะมีมาตรการในการรักษาความปลอดภัยของข้อมูลฯด้วยวิธีใดก็ตาม บริษัทฯยังคงขอให้ท่านพึงทราบว่าไม่มีวิธีการใดที่สามารถรักษาความปลอดภัยในการส่งข้อมูลหรือการจัดเก็บข้อมูลทางระบบอินเทอร์เน็ตหรือระบบอิเล็กทรอนิกส์ต่างๆ ได้อย่างครบถ้วนสมบูรณ์ ดังนั้นบริษัทฯ จึงไม่สามารถรับประกันความปลอดภัยของข้อมูลฯ ในระหว่างการส่งหรือจัดเก็บข้อมูลเข้าระบบของบริษัทฯ อย่างเบ็ดเสร็จได้ ทั้งนี้เพื่อเป็นการช่วยคุ้มครองสิทธิความเป็นส่วนตัวและการคุ้มครองข้อมูลฯ ของท่าน บริษัทจำเป็นต้องขอความร่วมมือจากท่านโดยการไม่เปิดเผย username รหัสผ่าน หรือข้อมูลฯ ของท่านกับบุคคลอื่น หรือใช้รหัสผ่านเดียวกับการบริการออนไลน์อื่น และกรณีที่ท่านมีความสงสัยว่ามีการเข้าถึงหรือใช้บัญชีของท่านโดยไม่ได้รับอนุญาต หรือมีการละเมิดใดเกิดขึ้นในระบบรักษาความปลอดภัย ให้ท่านแจ้งมายังบริษัทฯ โดยเร็วที่สุดเพื่อดำเนินการแก้ไขต่อไป

# policy10
source: <b>10. Your rights regarding your personal data</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>10.1 You have the following legal rights regarding your personal data:<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(1) Withdraw the consent you have given to the Company to process your personal data.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(2) Request to view and copy your personal data. Or request disclosure of the source of your personal data<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(3) Forward or transfer data in electronic form as required by the Personal Data Protection Act to another personal data controller.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(4) Object to the collection, use or disclosure of data relating to you. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(5) Delete or destroy or make your information anonymous. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(6) Suspend the use of your information. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(7) Correct your information to be correct, current, complete and not misleading. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(8) Complain to the Personal Data Protection Committee In the event that the Company or the personal data processor, including the Company's employees or contractors or the personal data processor violate or fail to comply with the Personal Data Protection Act<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>The rights mentioned above are in accordance with the Personal Data Protection Act. You can contact our officers to submit a request to exercise the rights mentioned above (according to the contact channels in the section 'Contacting the Company' below)
th: <b>10. สิทธิเกี่ยวกับข้อมูลส่วนบุคคลของท่าน</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>10.1 ท่านมีสิทธิตามกฎหมายเกี่ยวกับข้อมูลส่วนบุคคลของท่าน ดังนี้ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(1) ถอนความยินยอมที่ท่านได้ให้ไว้กับบริษัทฯ เพื่อประมวลผลข้อมูลส่วนบุคคลของท่าน<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(2) ขอดูและคัดลอกข้อมูลส่วนบุคคลของท่าน หรือขอให้เปิดเผยที่มาของข้อมูลส่วนบุคคลของท่าน<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(3) ส่งต่อ หรือโอนย้ายข้อมูลฯที่อยู่ในรูปแบบอิเล็กทรอนิกส์ตามที่กฎหมายคุ้มครองข้อมูลส่วนบุคคลกำหนดไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่น <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(4) คัดค้านการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลฯที่เกี่ยวกับท่าน <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(5) ลบหรือทำลาย หรือทำให้ข้อมูลฯของท่านเป็นข้อมูลที่ไม่สามารถระบุตัวตนของท่านได้ (Anonymous) <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(6) ระงับการใช้ข้อมูลฯของท่าน <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(7) แก้ไขข้อมูลฯท่านให้ถูกต้อง เป็นปัจจุบัน สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(8) ร้องเรียนต่อคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล ในกรณีที่บริษัทฯหรือผู้ประมวลผลข้อมูลส่วนบุคคล รวมทั้งลูกจ้างหรือผู้รับจ้างของบริษัทฯ หรือผู้ประมวลผลข้อมูลส่วนบุคคลฝ่าฝืนหรือไม่ปฏิบัติตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>ทั้งนี้ สิทธิตามที่กล่าวมาข้างต้น เป็นไปตามที่กฎหมายคุ้มครองข้อมูลส่วนบุคคลกำหนด ท่านสามารถติดต่อมาที่เจ้าหน้าที่ของเรา เพื่อดำเนินการยื่นคำร้องขอดำเนินการตามสิทธิข้างต้น (ตามรายละเอียดช่องทางการติดต่อในหัวข้อ “การติดต่อบริษัทฯ ” ด้านล่างนี้)

# policy11
source: <b>11. Users of the Service in Other Countries</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre> This service is suitable for users domiciled in Thailand only. If you use the service in other countries, the Company will assume that you agree to accept the risks on your own. Therefore, you should study the personal data protection laws and other relevant regulations of that country before using the service. When you agree to accept the terms of the policy, please be aware that<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>1) You consent to the transmission of data to Thailand, which may have data protection laws that are inconsistent with the laws of the country in which you reside. And<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>2) You agree to submit the data to the Company for use in accordance with the purposes of this policy.
th: <b>11. ผู้ใช้บริการฯที่อยู่ประเทศอื่น</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>บริการฯ นี้เหมาะสำหรับผู้ใช้ที่มีภูมิลำเนาอยู่ในประเทศไทยเท่านั้น หากท่านใช้บริการฯ ในประเทศอื่น บริษัทฯจะถือว่าท่านยินยอมรับความเสี่ยงต่างๆ ด้วยตัวเอง ดังนั้น ท่านควรศึกษากฎหมายการคุ้มครองข้อมูลส่วนบุคคลและข้อบังคับอื่นใดที่เกี่ยวข้องของประเทศนั้นก่อนใช้บริการฯ เมื่อท่านตกลงยอมรับเงื่อนไขของนโยบายฯ พึงทราบว่า<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>1) ท่านยินยอมให้ส่งผ่านข้อมูลฯ มายังประเทศไทย ซึ่งอาจมีกฎหมายคุ้มครองข้อมูลฯ ไม่สอดคล้องกับกฎหมายของประเทศที่ท่านพำนักอยู่ และ<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>2) ท่านยินยอมส่งมอบข้อมูลฯให้บริษัทฯใช้งานตามวัตถุประสงค์ของนโยบายฯฉบับนี้

# policy12
source: <b>12. Non-Thai Users</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>If you are not a Thai and use the Service or consent to provide the Company with information, the Company shall assume that you have expressly permitted the Company to use your information for processing. However, you still have the right to request that the processing of your information be suspended. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>The Company may need to forward your information to other countries so that the Company can continue to provide the Service as you request and may receive information transmitted from the country of your residence to Thailand and to third parties in other countries. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>In addition, if you contact the Company, please be aware that you have consented to the Company’s use, transmission and disclosure of your information across countries for the purposes of this contact. You should be aware that the data protection system, legal protection, and rights to access data may not be equal to your own country. However, the Company will carefully consider and strictly implement appropriate measures in accordance with this Policy to prevent any unrelated or unauthorized or unlawful person from using your data for benefits other than the purposes of this Policy.
th: <b>12. ผู้ใช้บริการฯที่ไม่ใช่บุคคลผู้มีสัญชาติไทย</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>หากท่านไม่ใช่บุคคลผู้มีสัญชาติไทย และใช้บริการฯหรือยินยอมให้ข้อมูลฯแก่บริษัทฯ บริษัทฯถือว่าท่านอนุญาตโดยชัดแจ้งให้บริษัทฯใช้ข้อมูลฯของท่านเพื่อการประมวลผลได้ อย่างไรก็ตาม ท่านยังคงมีสิทธิในการร้องขอให้ระงับการนำข้อมูลฯของท่านมาใช้ประมวลผลได้ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>บริษัทฯอาจจำเป็นต้องส่งต่อข้อมูลฯของท่านไปยังประเทศอื่นเพื่อให้บริษัทฯยังคงสามารถให้บริการฯได้ตามที่ท่านต้องการ และอาจรับข้อมูลฯที่ส่งผ่านจากประเทศที่ท่านพักอาศัยมายังในประเทศไทย และบุคคลที่สามในประเทศอื่น <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>นอกจากนี้ หากท่านดำเนินการติดต่อกับบริษัทฯ พึงทราบว่า ท่านได้ยินยอมให้บริษัทฯใช้งาน ส่งผ่าน และเปิดเผยข้อมูลฯข้ามประเทศภายใต้วัตถุประสงค์ของการติดต่อนี้ โดยท่านพึงรับรู้ว่าระบบการปกป้องข้อมูลฯ ความคุ้มครองทางกฎหมาย สิทธิในการเข้าถึงข้อมูลฯอาจไม่เท่าเทียมกับประเทศของท่านเอง อย่างไรก็ตาม บริษัทฯจะพิจารณาอย่างรอบคอบและใช้มาตรการที่เหมาะสมตามนโยบายฯนี้อย่างเคร่งครัด เพื่อป้องกันมิให้บุคคลอื่นใดที่ไม่เกี่ยวข้องหรือไม่ได้รับอนุญาตหรือไม่มีสิทธิตามกฎหมายนำข้อมูลฯของท่านไปใช้เพื่อประโยชน์อื่นนอกเหนือจากวัตถุประสงค์ของนโยบายฯนี้

# policy13
source: <b>13. Contacting the Company</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>If you would like to contact or ask for additional details about the collection, use or disclosure of personal information, the exercise of rights regarding personal information according to Section 10, or have any complaints regarding the information, you may contact the Company. You can do so through the following channels: <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>SCG Living and Housing Solution Co., Ltd.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>Contact Person: Data Protection Officer of the Company <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>Address: 1 Panusayathai Road, Bang Sue Subdistrict, Bang Sue District, Bangkok 10800 <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>Email: data.privacy@scg.com <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>Tel: 0-2586-3333<br/><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>This Privacy Policy is version 1.0, which was announced on September 9, 2023. In the event of any changes to this Privacy Policy, the Company will announce the new Privacy Policy via the Smart Living+ application or email message or other channels according to the contact information you have provided. The new Privacy Policy will be effective immediately on the date of announcement.
th: <b>13. การติดต่อบริษัทฯ</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>หากท่านต้องการติดต่อ หรือต้องการสอบถามรายละเอียดเพิ่มเติมเกี่ยวกับเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล การใช้สิทธิเกี่ยวกับข้อมูลส่วนบุคคลตามข้อ 10. หรือมีข้อร้องเรียนใดๆ เกี่ยวกับข้อมูลฯ ท่านสามารถติดต่อบริษัทฯ ได้ดังช่องทางต่อไปนี้ดังต่อไปนี้ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>บริษัท เอสซีจี ลีฟวิง แอนด์ เฮาส์ซิง โซลูชัน จำกัด<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>ผู้ติดต่อ: เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลของบริษัทฯ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>ที่อยู่: 1 ถนนปูนซิเมนต์ไทย แขวงบางซื่อ เขตบางซื่อ กรุงเทพมหานคร 10800 <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>อีเมล: data.privacy@scg.com <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>เบอร์โทร: 0-2586-3333<br/><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>นโยบายความเป็นส่วนตัวนี้เป็นเวอร์ชั่นที่ 1.0 ซึ่งได้ประกาศเมื่อวันที่ 9 กันยายน พ.ศ.2566 ในกรณีที่มีการแก้ไขเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้ บริษัทฯ จะประกาศนโยบายความเป็นส่วนตัวฉบับใหม่ผ่านทางแอปพลิเคชัน Smart Living+ หรือข้อความทางอีเมล หรือทางช่องทางอื่นๆ ตามข้อมูลการติดต่อที่ท่านได้ให้ไว้ โดยนโยบายความเป็นส่วนตัวฉบับใหม่จะมีผลบังคับใช้ทันทีในวันที่ประกาศ

# aboutCompany
source: SCG Living and Housing Solution Co., Ltd.
th: บริษัท เอสซีจี ลีฟวิง แอนด์ เฮาส์ซิง โซลูชัน จำกัด

# about1
source: Smart Living+ by SCG is an application that combines several living solutions together to improve the overall quality of living, consisting of
th: Smart Living+ by SCG คือ แอปพลิเคชันที่รวบรวมโซลูชันสำหรับการอยู่อาศัยหลายอย่างเข้าด้วยกันอย่างลงตัว เพื่อยกระดับคุณภาพการอยู่อาศัยโดยรวม ซึ่งประกอบไปด้วย

# about2
source: Solar Roof Solution that uses solar energy to increase the efficiency of energy use in the home, and users can check the energy use by themselves
th: Solar Roof Solution ที่ใช้พลังงานจากแสงอาทิตย์มาช่วยเพิ่มประสิทธิภาพการใช้พลังงานในบ้าน และผู้ใช้สามารถตรวจสอบการใช้พลังงานได้ด้วยตัวเอง

# about3
source: Air Quality Solution that allows users to check and improve the air quality in the home to make it suitable for living
th: Air Quality Solution ที่ช่วยให้ผู้ใช้สามารถตรวจสอบ และปรับปรุง คุณภาพอากาศภายในบ้านให้เหมาะแก่การอยู่อาศัย
