Repository: ujnim/smarthome_101
Catalog: lib/l10n/intl_*.arb
Languages: th

# about4
source: Smart Home Solution that allows users to control and command various smart devices in the home automatically, including lighting systems, electrical appliances, and security systems
th: Smart Home Solution ที่ทำให้ผู้ใช้สามารถควบคุมและสั่งงานอุปกรณ์ Smart ต่างๆ ในบ้านโดยอัตโนมัติ ได้แก่ ระบบแสงสว่าง เครื่องใช้ไฟฟ้าและ ระบบรักษาความปลอดภัย

# about5
source: In addition, it also includes a Health Monitoring solution that allows users to track important health data to improve their physical health
th: นอกจากนี้ ยังรวมเอาโซลูชันด้าน Health Monitoring ที่ช่วยให้ผู้ใช้สามารถติดตามข้อมูลสุขภาพที่สำคัญ เพื่อใช้ในการปรับปรุงสุขภาพทาง ร่างกายให้ดีขึ้น

# about6
source: This application will help users access a better quality of life sustainably by combining technology to create an environment for smart and harmonious living
th: แอปพลิเคชันนี้จะเป็นผู้ช่วยให้ผู้ใช้สามารถเข้าถึงการมีคุณภาพชีวิตที่ดีขึ้นได้อย่างยั่งยืน โดยการใช้เทคโนโลยีมาผสานรวมกันเพื่อสร้างสภาพแวดล้อมสำหรับการอยู่อาศัยอย่างชาญฉลาดและกลมกลืน

# aboutVersion
source: Version: 0.0.1
th: เวอร์ชัน: 0.0.1
