Repository: ujnim/smarthome_101
Catalog: lib/l10n/intl_*.arb
Languages: th

source: User
th: ผู้ใช้งาน

source: Done
th: ยืนยัน

source: Login
th: เข้าใช้งาน

# submit
source: Save
th: บันทึก

source: Cancel
th: ยกเลิก

source: Logout
th: ออกจากระบบ

source: Mobile
th: เบอร์โทรศัพท์

source: Register
th: ลงทะเบียน

# loginSubmit
source: Login
th: เข้าสู่ระบบ

source: Province
th: จังหวัด

source: District
th: เขต/อำเภอ

source: Sub district
th: แขวง/เขต

source: Postal Code
th: รหัสไปรษณีย์

source: Select
th: เลือก

source: Email
th: อีเมล

# emailValidation
source: Please enter a valid email address
th: กรุณากรอกอีเมลที่ถูกต้อง

# emailValidationIsNull
source: Please enter an email address
th: กรุณากรอกอีเมล

source: Password
th: รหัสผ่าน

# passwordValidation
source: Password must be at least 6 characters long
th: รหัสผ่านต้องมีความยาวอย่างน้อย 6 ตัวอักษร

# passwordValidationIsNull
source: Please enter a password
th: กรุณากรอกรหัสผ่าน

# navBarHome
source: Home
th: หน้าหลัก

# navBarProfile
source: Profile
th: โปรไฟล์

# navBarFavorites
source: Favorites
th: รายการโปรด

# aqiLoadingAddress
source: Retrieving current location data...
th: กำลังดึงข้อมูลตำแหน่งปัจจุบัน...

# aqiLoadingAddressError
source: Error retrieving data
th: เกิดข้อผิดพลาดในการดึงข้อมูล

# aqiLoadingAddressUnableData
source: Unable to retrieve air quality data
th: ไม่สามารถดึงข้อมูลคุณภาพอากาศได้

source: Settings
th: การตั้งค่า

# settingsHelp
source: Help
th: ความช่วยเหลือ

# settingsReport
source: Report a problem and get help
th: แจ้งปัญหา และขอความช่วยเหลือ

# settingsLanguage
source: Language
th: ภาษา

# settingsApplication
source: Application
th: แอปพลิเคชัน

# settingsNotifications
source: Notifications
th: การแจ้งเตือน

# settingsPrivacyPolicy
source: Privacy Policy
th: นโยบายการคุ้มครองข้อมูลส่วนบุคคล

# settingsHomeManagement
source: Manage Home and Members
th: จัดการบ้านและสมาชิก

# settingsLanguageCurrent
source: English
th: ภาษาไทย

# settingsTermsAndPolicies
source: Terms and Policies
th: ข้อกำหนดและนโยบาย

# settingsAboutTheApplication
source: About the application
th: เกี่ยวกับแอปพลิเคชัน

# settingsTermsAndConditionsOfService
source: Terms and Conditions of Service
th: ข้อกำหนดและเงื่อนไขการให้บริการ

# profileQRCodeHowScan
source: How does the homeowner scan?
th: เจ้าของบ้านสแกนอย่างไร

# profileQRCodeRefresh
source: Please refresh the home page or press the button below.
th: กรุณารีเฟรชหน้าหลักหรือกดปุ่มด้านล่าง

# profileQRCodeMyQRCode
source: My QR Code
th: QR Code ของฉัน

# profileQRCodeWhatScan
source: What is the scan into the house?
th: สแกนเข้าบ้านคืออะไร

# profileQRCodeScanStep1
source: 1. Enter the profile page.
th: 1.เข้าหน้าโปรไฟล์

# profileQRCodeScanStep2
source: 2. Enter the home and member management menu.
th: 2.เข้าเมนูจัดการบ้านและสมาชิก

# profileQRCodeScanStep3
source: 3. Select the house.
th: 3.เลือกบ้าน

# profileQRCodeScanStep4
source: 4. Click the plus icon on the top right corner and select 'Add member'.
th: 4.กดที่ไอคอนบวกมุมบนขวา แล้วเลือก 'เพิ่มสมาชิก'

# profileQRCodeAccessHome
source: Request access to the house data created by another member. (Homeowner)
th: การขอเข้าดูข้อมูลของบ้าน ที่สร้างโดยสมาชิกอื่น (เจ้าของบ้าน)

# profileQRCodeShowQRCode
source: Please show your QR Code
th: กรุณาแสดง QR Code ของคุณ

# profileQRCodeCheckStatus
source: Check status
th: ตรวจสอบสถานะ

# profileQRCodeHomeOwnerScan
source: Let Homeowner scan
th: ให้เจ้าของบ้านสแกน

# profileQRCodeSuccessAccess
source: If Homeowner scans QR Code and adds you to the home, it's done
th: หากเจ้าของบ้านสแกน QR Code และเพิ่มคุณเข้าบ้าน เสร็จเรียบร้อยแล้ว

# profileQRCodeCheckStatusOfHome
source: To check home access status
th: เพื่อตรวจสอบสถานะการเข้าบ้าน

# profileDetailErrorDataBOD
source: No Brith of date Available
th: ไม่มีข้อมูลวันเกิด

# profileDetailErrorDataName
source: No Name Available
th: ไม่มีชื่อ

# profileDetailErrorDataPhone
source: No Phone Available
th: ไม่มีหมายเลขโทรศัพท์

# profileDetailErrorDataEmail
source: No Email Available
th: ไม่มีอีเมล

# profileSettingBOD
source: Birthday
th: วันเกิด

# profileSettingName
source: Name
th: ชื่อ

# profileSettingTitle
source: Profile Settings
th: ตั้งค่าโปรไฟล์

# profileSettingPhone
source: Phone Number
th: เบอร์โทรศัพท์

# profileSettingEmail
source: Email
th: อีเมล

# profileSettingLastname
source: Last Name
th: นามสกุล

# profileSettingBODIsEmpty
source: Please enter your birthday
th: กรุณาใส่วันเกิด

# profileSettingNameIsEmpty
source: Please enter your first name
th: กรุณาใส่ชื่อ

# profileSettingEmailIsEmpty
source: Please enter your email
th: กรุณาใส่อีเมล

# profileSettingPhoneIsEmpty
source: Please enter your phone number
th: กรุณาใส่เบอร์โทรศัพท์

# profileSettingLastNameIsEmpty
source: Please enter your last name
th: กรุณาใส่นามสกุล

# profileSettingEmailValidation
source: Please enter a valid email
th: กรุณาใส่อีเมลที่ถูกต้อง

# homeListTitle
source: Manage Homes and Members
th: จัดการบ้านและสมาชิก

# homeListAddHome
source: Add Home
th: เพิ่มบ้าน

# homeListTotal
source: {room} rooms | {member} members
th: {room} ห้อง | {member} สมาชิก

# homeCreateTitle
source: Home Location
th: ตำแหน่งบ้าน

# homeCreateSubmit
source: Create a house
th: สร้างบ้าน

# homeCreateHomeName
source: House name
th: ชื่อบ้าน

# homeCreateFromTitle
source: House information
th: ข้อมูลบ้าน

# homeCreateDescription
source: Please provide real information for fast and convenient service
th: กรุณาระบุข้อมูลตามจริง เพื่อความสะดวกรวดเร็วในการรับบริการ

# homeCreateHomeAddress
source: Address
th: ที่อยู่

# homeCreateHomeNameError
source: Please enter a house name
th: กรุณากรอกชื่อบ้าน

# homeCreateHomeNameDescription
source: Name your house that is easy to remember, such as a house in Bangkok, your father's house, etc.
th: ตั้งชื่อบ้านที่ง่ายต่อการจำของคุณ เช่น บ้านที่กรุงเทพ บ้านคุณพ่อ เป็นต้น

# mapGetCurrentLocation
source: Retrieving current location...
th: กำลังดึงข้อมูลตำแหน่งปัจจุบัน...

# mapSelectCurrentLocation
source: Please select a location on the map
th: กรุณาเลือกตำแหน่งบนแผนที่

# mapGetCurrentLocationError
source: Could not retrieve current location
th: ไม่สามารถดึงข้อมูลตำแหน่งปัจจุบันได้

# termsDateStart
source: (Effective from 9 September 2023)
th: (เริ่มใช้ตั้งแต่วันที่ 9 กันยายน พ.ศ.2566)

# termsParagraph1
source: <pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>The terms and conditions of use of the Smart Living+ by SCG application presented here (hereinafter referred to as the “Terms and Conditions”) specify the agreement between SCG Living and Housing Solution Co., Ltd. (hereinafter referred to as the “Company”) and the user of the application (hereinafter referred to as the “User”) regarding any service or feature of the Smart Living+ by SCG application, which is provided by the Company (hereinafter referred to as the “Service”), including any contracts that may be made later between each other, even if these Terms and Conditions are not appended or specified.
th: <pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>ข้อกำหนดและเงื่อนไขการใช้งานแอปพลิเคชัน Smart Living+ by SCG ที่แสดงไว้ ณ ที่นี้ (ซึ่งต่อไปนี้เรียกว่า “ข้อกำหนดและเงื่อนไขฯ”) ระบุถึงข้อตกลงระหว่าง บริษัท เอสซีจี ลีฟวิง แอนด์ เฮาส์ซิง โซลูชัน จำกัด (ซึ่งต่อไปนี้เรียกว่า “บริษัทฯ”) และผู้ใช้งานแอปพลิเคชัน (ซึ่งต่อไปนี้เรียกว่า “ผู้ใช้”) เกี่ยวกับการบริการหรือคุณลักษณะใดๆ ของ แอปพลิเคชัน Smart Living+ by SCG ซึ่งบริษัทฯ เป็นผู้ให้บริการ (ซึ่งต่อไปนี้เรียกว่า “บริการฯ”) โดยหมายรวมถึงสัญญาใดๆ ที่อาจทำขึ้นในภายหลังระหว่างกัน แม้ว่าข้อกำหนดและเงื่อนไขฯ นี้จะไม่ได้นำมาผนวกไว้หรือระบุไว้ด้วยก็ตาม

# termsParagraph2
source: <pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>All general terms and conditions between the Company and the User that have arisen prior to these Terms and Conditions are expressly rejected by the effect of these Terms and Conditions, unless confirmed and approved by the Company in writing. Therefore, the User should study and understand the Terms and Conditions in detail before accepting this agreement for the User's own benefit.
th: <pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>ข้อกำหนดและเงื่อนไขทั่วไปทั้งหมดระหว่างบริษัทฯและผู้ใช้ ที่เกิดขึ้นก่อนหน้าข้อกำหนดและเงื่อนไขฯนี้ จะถูกปฏิเสธอย่างชัดแจ้งโดยผลของข้อกำหนดและเงื่อนไขฯนี้ เว้นแต่จะได้รับการยืนยันและเห็นชอบจากบริษัทฯ เป็นลายลักษณ์อักษร ดังนั้น ผู้ใช้ควรศึกษาและทำความเข้าใจข้อกำหนดและเงื่อนไขฯ โดยละเอียดก่อนยอมรับข้อตกลงนี้เพื่อประโยชน์ของผู้ใช้เอง

# terms1
source: <b>1. Definitions</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>The following words and phrases shall have the meanings set out below when used in these Terms and Conditions.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>1) “<b>Application</b>” means the application named “Smart Living+ by SCG” which is provided, developed and/or customized by the Company, both in the form of use on mobile phones and other electronic devices for the use of the Services as defined in Section 7.1 on the basis of this Service.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>2) “<b>Content</b>” means various information, including but not limited to text, images, videos, software, programs, computer code, residential location coordinates and other similar items, related to and necessary for the Service. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>3) “<b>Additional Terms and Conditions</b>” means documents that the Company later changes, edits, or uploads related to the Service, including agreements and/or policies, and other matters of a similar nature related to the Service. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4) “<b>Service</b>” means the provision of the “Smart Living+ by SCG” application for Users, managed and managed by the Company. This includes any other services of the Company related to such Service that may occur in the future (if any). <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>5) “<b>Personal Data</b>” means identity, data necessary for payment, transaction data, and any other personal data about the service recipient, in accordance with the Personal Data Protection Act, excluding data about the User in the event that the User dies. and does not include statistical data or data that cannot identify the individual who owns the personal data, which is not considered personal data under the Personal Data Protection Act
th: <b>1. คำนิยาม</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>คำและข้อความต่อไปนี้จะมีความหมายตามที่ระบุไว้ด้านล่างนี้ เมื่อมีการใช้ในข้อกำหนดและเงื่อนไขฯ<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>1) “<b>แอปพลิเคชัน</b>” หมายถึง แอปพลิเคชันชื่อ “Smart Living+ by SCG” ที่บริษัทฯ เป็นผู้ให้บริการ พัฒนาและ/หรือปรับแต่ง ทั้งในรูปแบบที่ใช้งานบนโทรศัพท์มือถือและอุปกรณ์อิเล็กทรอนิคส์อื่นใดสำหรับการใช้งานบริการฯ ที่กำหนดไว้ในข้อ 7.1 บนพื้นฐานของการให้บริการฯ นี้ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre> 2) “<b>เนื้อหา</b>” หมายถึง ข้อมูลต่างๆ รวมถึงแต่ไม่จำกัดเพียง ข้อความ รูปภาพ วีดีโอ ซอฟต์แวร์ โปรแกรม รหัสคอมพิวเตอร์ พิกัดตำแหน่งของที่พักอาศัย และสิ่งอื่นๆที่คล้ายคลึงกัน ที่เกี่ยวข้องและจำเป็นกับการให้บริการฯ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>3) “<b>ข้อกำหนดและเงื่อนไขฯ เพิ่มเติม</b>” หมายถึง เอกสารที่บริษัทฯ เปลี่ยนแปลง แก้ไข หรืออัพโหลดต่อมาในภายหลังซึ่งเกี่ยวกับบริการฯ ทั้งในเรื่องข้อตกลง และ/หรือ นโยบาย และเรื่องอื่นๆ ในทำนองเดียวกันอันเกี่ยวข้องกับบริการฯ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4) “<b>บริการ</b>” หมายถึง การให้บริการแอปพลิเคชัน “Smart Living+ by SCG” สำหรับผู้ใช้ ที่บริหารและจัดการโดยบริษัทฯ ทั้งนี้ ให้หมายความรวมถึงบริการอื่นใดของบริษัทฯ ที่เกี่ยวเนื่องกับบริการดังกล่าวที่อาจเกิดขึ้นในอนาคต (หากมี)<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>5) “<b>ข้อมูลส่วนบุคคล</b>”ตัวตน ข้อมูลที่จำเป็นสำหรับการชำระเงิน ข้อมูลการทำธุรกรรม และข้อมูลส่วนบุคคลอื่นใดที่เกี่ยวกับผู้รับบริการ ตามกฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคล ทั้งนี้ ไม่รวมถึงข้อมูลเกี่ยวกับผู้ใช้ในกรณีที่ผู้ใช้ถึงแก่กรรม และไม่รวมถึงข้อมูลทางสถิติหรือข้อมูลที่ไม่สามารถระบุตัวบุคคลที่เป็นเจ้าของข้อมูลส่วนบุคคลได้ ซึ่งไม่ถือเป็นข้อมูลส่วนบุคคลตามกฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคล

# terms2
source: <b>2. Acceptance of Terms and Conditions</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>2.1 The User must use the Service in accordance with the agreement specified in these Terms and Conditions. However, the User will not be able to use the Service or access any content of the Service unless the User has agreed to accept these Terms and Conditions. Such acceptance is complete and irrevocable.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>2.2 A person who can use the Service must be at least 13 years old. A person under 13 years of age must receive consent from a parent or legal guardian in order to be able to use the Service. Such acceptance is complete and irrevocable. The Company will consider that the parent or legal guardian who gives consent is responsible for the results resulting from using the Service. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>2.3 If the user uses the service on behalf of or for the purposes of any business organization, it shall be deemed that such business organization has agreed to accept these terms and conditions, which such agreement is complete and irrevocable.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>2.4 Any actions that the Company has taken in accordance with these terms and conditions and/or according to the information or request that the user has notified the Company shall be binding on the user in all respects.
th: <b>2. การตกลงยอมรับข้อกำหนดและเงื่อนไขฯ </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>2.1 ผู้ใช้จะต้องใช้บริการฯ ตามข้อตกลงที่ระบุไว้ในข้อกำหนดและเงื่อนไขฯ นี้ อย่างไรก็ตาม ผู้ใช้จะยังไม่สามารถใช้บริการฯ หรือเข้าถึงเนื้อหาใดๆ ของบริการฯ ได้ เว้นเสียแต่ผู้ใช้ได้ตกลงยอมรับข้อกำหนดและเงื่อนไขฯ นี้ การตกลงยอมรับดังกล่าวมีผลสมบูรณ์และเพิกถอนมิได้<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>2.2 บุคคลที่สามารถใช้บริการฯได้ต้องมีอายุไม่ต่ำกว่า 13 ปีบริบูรณ์ โดยบุคคลผู้มีอายุต่ำกว่า 13 ปีบริบูรณ์ ต้องได้รับความยินยอมจากบิดามารดาหรือผู้ปกครองตามกฎหมายเท่านั้น เพื่อจะสามารถใช้บริการฯได้ ซึ่งการตกลงยอมรับดังกล่าวมีผลสมบูรณ์และเพิกถอนมิได้ ทั้งนี้ บริษัทฯจะถือว่าบิดามารดาหรือผู้ปกครองตามกฎหมายผู้ให้ความยินยอม เป็นผู้รับผิดชอบต่อผลลัพธ์อันเกิดจากการใช้บริการฯ ของบุคคลผู้มีอายุต่ำกว่า 13 ปีบริบูรณ์ผู้นั้น<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>2.3 หากผู้ใช้ ใช้บริการฯแทนหรือเพื่อวัตถุประสงค์ขององค์กรธุรกิจใดๆ จะถือว่าองค์กรธุรกิจดังกล่าวได้ตกลงยอมรับข้อกำหนดและเงื่อนไขฯนี้ด้วย ซึ่งการตกลงยอมรับดังกล่าวมีผลสมบูรณ์และเพิกถอนมิได้<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>2.4 บรรดาการใดๆ ที่บริษัทฯได้กระทำไปตามข้อกำหนดและเงื่อนไขฯนี้ และ/หรือ ตามข้อมูลหรือตามคำร้องขอที่ผู้ใช้ได้แจ้งต่อบริษัทฯ ให้มีผลผูกพันผู้ใช้ทุกประการ

# terms3
source: <b>3. Changes to the Terms and Conditions.</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>The Company may amend the Terms and Conditions or Additional Terms and Conditions when the Company deems necessary without prior notice to the User. The amendment shall be effective when the amended Terms and Conditions or Additional Terms and Conditions are posted in an appropriate location, which may be displayed within the application or any other location or channel that the Company deems appropriate. The User's continued use of the Service shall be deemed to have given its complete and irrevocable acceptance of the amended Terms and Conditions or Additional Terms and Conditions. Therefore, the User should carefully study the amended Terms and Conditions or Additional Terms and Conditions. If the User does not wish to continue using the Service, the User may cancel by deleting the User's account and uninstalling the application from the User's mobile phone or other electronic device. In addition, the User should regularly check the Terms and Conditions during use, as there may not be a separate notification of such amendments to the Terms and Conditions. The Company may amend the Terms and Conditions or Additional Terms and Conditions when the Company deems necessary. Without prior notice to the User, the amendment shall be effective upon posting of the amended Terms and Conditions or the amended Additional Terms and Conditions in an appropriate location, which may be displayed within the Application or any other location or channel that the Company deems appropriate. The User's continued use of the Service shall be deemed to be the User's complete and irrevocable acceptance of the amended Terms and Conditions or the amended Additional Terms and Conditions. Therefore, the User should carefully study the amended Terms and Conditions or the amended Additional Terms and Conditions. If the User does not wish to continue using the Service, the User may cancel by deleting the User's account and uninstalling the Application from the User's mobile phone or other electronic device. In addition, the User should check the Terms and Conditions regularly during use, as there may not be separate notifications about such amendments to the Terms and Conditions.
th: <b>3. การเปลี่ยนแปลงข้อกำหนดและเงื่อนไขฯ </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>บริษัทฯอาจแก้ไขเปลี่ยนแปลงข้อกำหนดและเงื่อนไขฯ หรือ ข้อกำหนดและเงื่อนไขฯเพิ่มเติม เมื่อบริษัทเห็นว่ามีความจำเป็น โดยไม่ต้องให้คำบอกกล่าวล่วงหน้าแก่ผู้ใช้ โดยการแก้ไขจะมีผลบังคับเมื่อมีการประกาศข้อกำหนดและเงื่อนไขฯที่แก้ไข หรือ ข้อกำหนดและเงื่อนไขฯเพิ่มเติมที่แก้ไข ไว้ในสถานที่ที่เหมาะสมซึ่งอาจแสดงอยู่ภายในแอปพลิเคชัน หรือสถานที่ หรือช่องทางอื่นใดที่บริษัทฯ เห็นสมควร การที่ผู้ใช้ใช้บริการฯ ต่อไปถือว่าผู้ใช้ได้ให้การยอมรับ ที่มีผลสมบูรณ์และเพิกถอนมิได้ต่อข้อกำหนดและเงื่อนไขฯที่แก้ไขแล้ว หรือข้อกำหนดและเงื่อนไขฯเพิ่มเติมที่แก้ไขแล้ว ดังนั้น ผู้ใช้ควรศึกษาข้อกำหนดและเงื่อนไขฯที่แก้ไข หรือ ข้อกำหนดและเงื่อนไขฯเพิ่มเติมที่แก้ไข อย่างระมัดระวัง หากผู้ใช้ไม่ประสงค์ที่จะใช้บริการฯ ต่อไป ผู้ใช้สามารถยกเลิกได้โดยการลบบัญชีของผู้ใช้และถอนการติดตั้งแอปพลิเคชันออกจากโทรศัพท์มือถือหรืออุปกรณ์อิเล็กทรอนิคส์อื่นใดของผู้ใช้ นอกจากนี้ ผู้ใช้ควรตรวจสอบข้อกำหนดและเงื่อนไขฯ อยู่เป็นประจำระหว่างใช้งาน เนื่องจากอาจไม่มีการแจ้งเตือนแยกต่างหากเกี่ยวกับการแก้ไขข้อกำหนดและเงื่อนไขฯ ดังกล่าว บริษัทฯอาจแก้ไขเปลี่ยนแปลงข้อกำหนดและเงื่อนไขฯ หรือ ข้อกำหนดและเงื่อนไขฯเพิ่มเติม เมื่อบริษัทเห็นว่ามีความจำเป็น โดยไม่ต้องให้คำบอกกล่าวล่วงหน้าแก่ผู้ใช้ โดยการแก้ไขจะมีผลบังคับเมื่อมีการประกาศข้อกำหนดและเงื่อนไขฯที่แก้ไข หรือ ข้อกำหนดและเงื่อนไขฯเพิ่มเติมที่แก้ไข ไว้ในสถานที่ที่เหมาะสมซึ่งอาจแสดงอยู่ภายในแอปพลิเคชัน หรือสถานที่ หรือช่องทางอื่นใดที่บริษัทฯ เห็นสมควร การที่ผู้ใช้ใช้บริการฯ ต่อไปถือว่าผู้ใช้ได้ให้การยอมรับ ที่มีผลสมบูรณ์และเพิกถอนมิได้ต่อข้อกำหนดและเงื่อนไขฯที่แก้ไขแล้ว หรือข้อกำหนดและเงื่อนไขฯเพิ่มเติมที่แก้ไขแล้ว ดังนั้น ผู้ใช้ควรศึกษาข้อกำหนดและเงื่อนไขฯที่แก้ไข หรือ ข้อกำหนดและเงื่อนไขฯเพิ่มเติมที่แก้ไข อย่างระมัดระวัง หากผู้ใช้ไม่ประสงค์ที่จะใช้บริการฯ ต่อไป ผู้ใช้สามารถยกเลิกได้โดยการลบบัญชีของผู้ใช้และถอนการติดตั้งแอปพลิเคชันออกจากโทรศัพท์มือถือหรืออุปกรณ์อิเล็กทรอนิคส์อื่นใดของผู้ใช้ นอกจากนี้ ผู้ใช้ควรตรวจสอบข้อกำหนดและเงื่อนไขฯ อยู่เป็นประจำระหว่างใช้งาน เนื่องจากอาจไม่มีการแจ้งเตือนแยกต่างหากเกี่ยวกับการแก้ไขข้อกำหนดและเงื่อนไขฯ ดังกล่าว

# terms4
source: <b>4. The user agrees to allow the company to proceed as follows:</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>Under the agreement to accept these terms and conditions, the user agrees to allow the company to proceed as follows: <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.1 The company may use and/or access information, including but not limited to personal information (in accordance with the scope and conditions of the Privacy Policy (“Privacy Policy”)), the user’s content information, the user’s residential location, with the purpose of processing such information as necessary under the purpose of the service, acting on behalf of the user in storing, translating, creating related and continuous service works, distributing the user’s content to related services linked through any form of media, whether displayed alone or combined with other content or information, regardless of the form, method, and technology, whether currently known or created hereafter, including the use of the user’s content, information, and comments, suggestions to improve the service. To be more efficient in the future.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.2 The User agrees to grant the same rights in Section 4.1 to third parties involved in the content and services in any part of the Company, including the right to make agreements between the Company and third parties or partners based on this service. However, in terms of the User's personal data, it shall be in accordance with the scope and conditions of the Privacy Policy.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.3 The User agrees to grant the Company the right to access, use, backup, disclose some or all of the User's Content if the Company is required to do so by law or by court order. The Company will notify the User of such requirements or orders before taking action, and the Company will take legal steps to request that such content be protected from being disclosed to the public.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.4 The User agrees to grant the Company the rights. In the use of the processing system, bandwidth and hardware used to store information on the user's mobile phone or other electronic device for the operation of this service
th: <b>4. ผู้ใช้ยินยอมให้บริษัทฯ ดำเนินการ ดังต่อไปนี้ </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>ภายใต้การตกลงยอมรับข้อกำหนดและเงื่อนไขฯนี้ ผู้ใช้ได้ตกลงให้บริษัทฯ ดำเนินการ ดังนี้ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.1 บริษัทฯ สามารถดำเนินการใช้ และ/หรือ เข้าถึงข้อมูล รวมถึงแต่ไม่จำกัดเพียง ข้อมูลส่วนบุคคล (ตามขอบเขตและข้อกำหนดในนโยบายคุ้มครองข้อมูลส่วนบุคคล (“Privacy Policy”)) ข้อมูลเนื้อหาของผู้ใช้ ตำแหน่งบ้านพักอาศัยของผู้ใช้ โดยมีวัตถุประสงค์เพื่อการประมวลผลข้อมูลดังกล่าวที่จำเป็นภายใต้วัตถุประสงค์ของบริการฯ ดำเนินการแทนผู้ใช้ในการจัดเก็บ แปลภาษา สร้างงานบริการที่เกี่ยวข้องและต่อเนื่องได้ แจกจ่ายเนื้อหาของผู้ใช้ไปยังบริการที่เกี่ยวข้องเชื่อมโยงผ่านสื่อกลางรูปแบบใดก็ตาม ทั้งแสดงแบบเดี่ยวหรือนำไปผสมผสานกับเนื้อหาหรือข้อมูลอื่นๆ ไม่ว่าจะด้วยรูปแบบ วิธีการ และ เทคโนโลยีใดก็ตาม ทั้งที่ได้ทราบแล้วขณะนี้หรือสร้างขึ้นหลังจากนี้ก็ตาม รวมถึงการนำเนื้อหาข้อมูลฯของผู้ใช้และข้อคิดเห็น ข้อเสนอแนะ มาใช้เพื่อปรับปรุงบริการฯ ให้มีประสิทธิภาพยิ่งขึ้นต่อไป<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.2 ผู้ใช้ยินยอมให้สิทธิเช่นเดียวกันนี้ในข้อ 4.1 แก่บุคคลที่สามที่มีความเกี่ยวข้องกับเนื้อหาและบริการฯ ในส่วนใดๆก็ตามของบริษัทฯ รวมถึงสิทธิในการทำข้อตกลงระหว่างบริษัทฯ กับบุคคลที่สามหรือพันธมิตรบนพื้นฐานของบริการฯนี้ อย่างไรก็ตาม ในส่วนของข้อมูลส่วนบุคคลของผู้ใช้ ให้เป็นไปตามขอบเขตและข้อกำหนดใน Privacy Policy ต่อไป <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.3 ผู้ใช้ยินยอมให้สิทธิบริษัทฯ เข้าถึง ใช้งาน เก็บสำรอง เปิดเผยเนื้อหาฯของผู้ใช้บางส่วนหรือทั้งหมด หากบริษัทฯ ถูกกำหนดให้ต้องกระทำโดยกฎหมายหรือตามคำสั่งศาล ทั้งนี้ บริษัทฯ จะแจ้งให้ผู้ใช้ได้รับทราบถึงข้อกำหนดหรือคำสั่งดังกล่าวก่อนที่จะดำเนินการ และบริษัทฯจะดำเนินการตามขั้นตอนทางกฎหมายเพื่อขอให้คุ้มครองเนื้อหาดังกล่าวไม่ให้ถูกเปิดเผยต่อสาธารณะด้วย <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.4 ผู้ใช้ยินยอมให้สิทธิแก่บริษัทฯ ในการใช้งานระบบประมวลผล แบนด์วิดท์ (Bandwidth) และ ฮาร์ดแวร์ที่ใช้เก็บข้อมูลบนโทรศัพท์มือถือหรืออุปกรณ์อิเล็กทรอนิคส์อื่นใดของผู้ใช้เพื่อการปฏิบัติการของบริการฯ นี้
