Repository: ujnim/smarthome_101
Catalog: lib/l10n/intl_*.arb
Languages: th

# terms10
source: <b>10. Application Security Policy </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre> The user acknowledges that the transmission of information via the Internet may be insecure. The Company does not guarantee or is not responsible for the security of the information, content or personal information that the user sends to the Company via the application or any other channels via the use of the Internet. The user agrees to accept the risk of transmitting such information by himself. However, the Company will use standard Internet network security technology and measures to help protect the user's information while transmitting it via the communication network or from being stolen by unauthorized persons or networks connecting to the Company's network in order to enhance the security of the use of this application
th: <b>10. นโยบายการรักษาความปลอดภัยของแอปพลิเคชัน </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre> ผู้ใช้รับทราบว่าการส่งข้อมูลทางอินเตอร์เน็ตนั้นอาจมีความไม่ปลอดภัย โดยบริษัทฯ จะไม่รับรองหรือไม่รับผิดชอบในความปลอดภัยของข้อมูล เนื้อหา หรือข้อมูลส่วนบุคคล ที่ผู้ใช้ส่งมาให้บริษัทฯ ทางแอปพลิเคชัน หรือช่องทางอื่นใดผ่านการใช้งานอินเตอร์เน็ต โดยผู้ใช้ตกลงยอมรับความเสี่ยงในการส่งผ่านข้อมูลดังกล่าวด้วยตนเอง อย่างไรก็ตาม บริษัทฯ จะใช้เทคโนโลยีและมาตรการรักษาความปลอดภัยบนเครือข่ายอินเตอร์เน็ตที่ได้มาตรฐาน เพื่อเป็นตัวช่วยในการป้องกันข้อมูลของผู้ใช้ระหว่างส่งข้อมูลผ่านเครือข่ายการสื่อสาร หรือจากการถูกโจรกรรมข้อมูลโดยบุคคลหรือเครือข่ายอื่นที่ไม่ได้รับอนุญาตเข้ามาเชื่อมต่อกับเครือข่ายของบริษัทฯ เพื่อยกระดับการรักษความปลอดภัยของการใช้งานแอปพลิเคชันนี้

# terms11
source: <b>11. Disclaimer of Warranty and Limitation of Liability of the Company</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.1 The use of all or part of the Services, activities provided by the Company through registration for use by the User's account, is the sole responsibility of the User of that account. It is the User's responsibility to keep the password for accessing the account confidential and not disclose it to anyone. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.2 The Services and Content that the Company provides for Users to use in accordance with the purpose of providing this Service are only tools to facilitate Users in doing all or part of the activities based on the Service. The Company does not guarantee, either expressly or impliedly, that the results of any activities based on the Service will be successful in accordance with the User's desires, and the Company is not responsible for making the results of any activities successful in accordance with the User's desires, including that this Service is not a service. For saving the life or property of the User and cannot replace the work of professional staff in saving the life or property in any way. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.3 The Company is not responsible for the delay of the notification system to the User's mobile phone or other electronic device based on the Service and the Content provided by the Company, regardless of the cause. The User shall be responsible for providing other measures apart from the Service provided by the Company to cope with the situation appropriately according to the User's needs. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.4 The Company may take any measures it deems necessary and appropriate to suspend or limit the User's use of the Service if the Company is aware or sees that any User is using the Service in a way that violates the Terms and Conditions or uses the Service in a way that causes damage, annoyance to the Company or any person or nearby place, and the Company is not responsible for any measures to suspend or limit the use of the Service. From such violation to the User or other persons.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.5 The User shall be aware that backing up important Content is the User's own responsibility. Therefore, the User shall regularly check and maintain the backing up of Content to avoid permanent loss of Content.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.6 In the event that any loss/damage to the Company occurs or the Company is charged with any expenses or damages, including but not limited to attorney's fees, whether directly or indirectly, including but not limited to the case where a third party sues the Company for damages due to the User's violation of relevant laws or the Terms and Conditions while using the Service, the User shall immediately compensate the Company for any damages incurred upon request by the Company. Such a claim for damages shall not preclude the Company from taking legal action, if necessary.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.7 The Company No warranty, express or implied, is made that the Service, including the Content, will be free from actual or legal defects, including but not limited to stability, reliability, accuracy, completeness, effectiveness, fitness for a particular purpose, defects, errors, security defects, or infringement of rights, and the Company is not responsible for providing such defect-free Service. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.8 The Company shall not be responsible for any damages incurred by the User in connection with the use of the Service caused by force majeure that the Company cannot control, including the failure of the equipment, communication system or connection signal to work, or interference from computer viruses, or from illegal acts, delays or defects of the User's equipment or of the Internet Service Provider or other communication networks, including natural disasters and man-made disasters. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.9 The Company shall not be responsible for any damages incurred by the User in connection with the use of the Service, including linking to Persons and external websites based on this Service. However, if the agreement, including but not limited to the Terms and Conditions, between the Company and the User regarding the Service is interpreted as a consumer contract under the Consumer Contract Law in Thailand, this exclusion of liability shall not apply.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.10 Notwithstanding the provisions of Section 11.9 above, the Company shall not be liable for any indirect, special, incidental, consequential or punitive damages, including but not limited to damages that the Company or the User could have anticipated or could have anticipated. In connection with the Company's breach of contract or tort, the Company shall be liable for actual damages, but shall be limited to the maximum amount not exceeding the value of the goods and services paid by the User to the Company.
th: <b>11. ข้อสงวนสิทธิการรับประกันและข้อจำกัดความรับผิดของบริษัทฯ</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.1 การใช้บริการฯ ทั้งหมดหรือบางส่วนของกิจกรรมต่างๆ ที่บริษัทฯ ให้บริการ ผ่านการลงทะเบียนเข้าใช้งานโดยบัญชีของผู้ใช้ ถือเป็นความรับผิดชอบของผู้ใช้งานบัญชีนั้นแต่เพียงผู้เดียว และเป็นความรับผิดชอบของผู้ใช้ในการรักษาข้อมูลรหัสผ่านเพื่อเข้าใช้งานบัญชีให้เป็นความลับและไม่เปิดเผยให้ผู้ใดทราบ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.2 บริการและเนื้อหาฯ ที่บริษัทฯ จัดเตรียมให้ผู้ใช้ได้ใช้งานตามวัตถุประสงค์ของการให้บริการฯ นี้ เป็นเพียงเครื่องมือช่วยอำนวยความสะดวกให้ผู้ใช้ในการทำกิจกรรมต่างๆ ทั้งหมดหรือบางส่วนบนพื้นฐานของบริการฯเท่านั้น บริษัทฯไม่รับประกันไม่ว่าโดยชัดแจ้งหรือโดยปริยายว่าผลลัพธ์ของกิจกรรมใดๆ บนพื้นฐานของบริการฯ จะสำเร็จตามความพึงพอใจที่ผู้ใช้ต้องการ และบริษัทฯไม่มีหน้าที่รับผิดชอบในการที่จะทำให้ผลลัพธ์ของกิจกรรมใดๆ สำเร็จตามวัตถุประสงค์ที่ผู้ใช้ต้องการ รวมถึงบริการฯ นี้ไม่ได้เป็นบริการฯ สำหรับการช่วยชีวิตหรือทรัพย์สินใดๆ ของผู้ใช้ และไม่อาจทดแทนการปฏิบัติงานโดยพนักงานเจ้าหน้าที่ผู้เชียวชาญในการช่วยชีวิตหรือทรัพย์สินแต่อย่างใด <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.3 บริษัทฯ ไม่รับผิดชอบต่อความล่าช้าของระบบการแจ้งเตือน (Notification) มายังโทรศัพท์มือถือหรืออุปกรณ์อิเล็กทรอนิคส์อื่นใดของผู้ใช้บนพื้นฐานของบริการฯ และเนื้อหาที่บริษัทฯจัดเตรียมให้นี้ ไม่ว่าจะเกิดขึ้นเนื่องจากสาเหตุใดก็ตาม ผู้ใช้จะต้องรับผิดชอบในการจัดหามาตรการอื่นใดนอกเหนือจากบริการฯ ที่บริษัทฯจัดเตรียมไว้ให้ เพื่อรับมือต่อสถานการณ์ได้อย่างเหมาะสมตามความต้องการของผู้ใช้<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.4 บริษัทฯ อาจใช้มาตรการใดๆ ที่เห็นว่าจำเป็นและเหมาะสมในการระงับหรือจำกัดการใช้บริการฯ ของผู้ใช้หากบริษัทฯ รับทราบหรือเห็นว่าผู้ใช้รายใดรายหนึ่งกำลังใช้บริการฯ ในทางที่ฝ่าฝืนข้อกำหนดและเงื่อนไขฯ หรือใช้บริการฯ ไปในทางที่ก่อให้เกิดความเสียหาย เดือดร้อนรำคาญแก่บริษัทฯ หรือบุคคลใด หรือสถานที่ใกล้คียง โดยบริษัทฯ ไม่จำต้องรับผิดชอบต่อมาตรการใดๆ ในการระงับหรือจำกัดการใช้บริการฯ จากการฝ่าฝืนดังกล่าวต่อผู้ใช้หรือบุคคลอื่นๆ<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.5 ผู้ใช้พึงตระหนักว่าการเก็บสำรองเนื้อหาที่สำคัญเป็นความรับผิดชอบของผู้ใช้เอง ดังนั้น ผู้ใช้จำเป็นต้องตรวจสอบดูแลการเก็บสำรองเนื้อหา อย่างสม่ำเสมอ เพื่อหลีกเลี่ยงการสูญเสียเนื้อหาอย่างถาวร<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.6 ในกรณีที่เกิดความสูญเสีย/ความเสียหายแก่บริษัทฯ หรือบริษัทฯถูกเรียกเก็บค่าใช้จ่ายหรือค่าเสียหายใดๆ ซึ่งรวมถึงแต่ไม่จำกัดเพียงค่าทนายความ ไม่ว่าโดยตรงหรือโดยอ้อม ซึ่งรวมถึงแต่ไม่จำกัดเพียงกรณีที่มีบุคคลภายนอกฟ้องร้องเรียกค่าเสียหายจากบริษัทฯ อันเนื่องมาจากการที่ผู้ใช้ฝ่าฝืนกฎหมายที่เกี่ยวข้อง หรือข้อกำหนดและเงื่อนไขฯ ในขณะที่ใช้บริการฯ ผู้ใช้จะต้องชดใช้ค่าเสียหายให้แก่บริษัทฯ ที่เกิดขึ้นทันทีที่บริษัทฯ ร้องขอ ทั้งนี้ การเรียกร้องค่าเสียหายดังกล่าว ไม่ถือเป็นการตัดสิทธิบริษัทฯ ในการดำเนินคดีตามกฎหมาย หากมีความจำเป็น<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.7 บริษัทฯ ไม่รับประกันไม่ว่าโดยชัดแจ้งหรือโดยปริยายว่า บริการฯ ซึ่งรวมถึงเนื้อหาจะปราศจากข้อบกพร่องตามจริงหรือตามกฎหมาย ซึ่งรวมถึงแต่ไม่จำกัดเพียง เสถียรภาพ การไว้วางใจได้ ความถูกต้อง ความสมบูรณ์ การมีประสิทธิผล ความเหมาะสมในการใช้เพื่อวัตถุประสงค์เฉพาะ ข้อบกพร่อง ข้อผิดพลาด จุดบกพร่องที่เกี่ยวกับความปลอดภัย หรือการละเมิดสิทธิต่างๆ และบริษัทฯ ไม่มีความรับผิดชอบในการที่จะต้องจัดหาบริการฯ ที่ไม่มีข้อบกพร่องดังกล่าว<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.8 บริษัทฯจะไม่รับผิดชอบต่อค่าเสียหายใดๆ ที่เกิดขึ้นกับผู้ใช้อันเกี่ยวกับการใช้บริการฯ อันเกิดจากเหตุสุดวิสัยที่บริษัทฯไม่สามารถควบคุมได้ ซึ่งรวมถึงการที่อุปกรณ์ ระบบสื่อสารหรือการส่งสัญญาณเชื่อมต่อไม่ทำงาน หรือการรบกวนจากไวรัสคอมพิวเตอร์ หรือจากการกระทำที่ไม่ชอบด้วยกฎหมาย ความล่าช้าหรือความบกพร่องของอุปกรณ์ของผู้ใช้ หรือของผู้ให้บริการระบบอินเทอร์เน็ต (Internet Service Provider) หรือเครือข่ายสื่อสารอื่น รวมถึงภัยพิบัติทางธรรมชาติและภัยพิบัติที่มนุษย์สร้างขึ้น<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.9 บริษัทฯจะไม่รับผิดชอบต่อค่าเสียหายใดๆ ที่เกิดขึ้นกับผู้ใช้อันเกี่ยวกับการใช้บริการ รวมถึงการเชื่อมโยงไปยัง บุคคลและเว็บไซต์ภายนอกบนพื้นฐานของบริการฯ นี้ อย่างไรก็ตาม หากมีการตีความว่าข้อตกลง ซึ่งรวมถึงแต่ไม่จำกัดเพียงข้อกำหนดและเงื่อนไขฯ ระหว่างบริษัทฯ และผู้ใช้เกี่ยวกับบริการฯ เป็นสัญญาผู้บริโภคตามกฎหมายว่าด้วยสัญญาผู้บริโภคในประเทศไทย ข้อยกเว้นความรับผิดนี้จะไม่นำมาบังคับใช้<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>11.10 ไม่ว่าเงื่อนไขที่ระบุไว้ในข้อ 11.9 ข้างต้นจะกำหนดไว้อย่างไร บริษัทฯ จะไม่ต้องรับผิดชอบต่อค่าเสียหายโดยอ้อม ค่าเสียหายพิเศษ ค่าเสียหายเนื่องจากการผิดสัญญา ค่าเสียหายต่อเนื่องหรือค่าเสียหายเชิงลงโทษใดๆซึ่งรวมถึงแต่ไม่จำกัดเพียงค่าเสียหายที่บริษัทฯ หรือผู้ใช้สามารถคาดการณ์หรือน่าจะคาดการณ์ได้ ในส่วนที่เกี่ยวกับการผิดสัญญาหรือการกระทำละเมิดของบริษัทฯ บริษัทฯ จะรับผิดชดใช้ค่าเสียหายตามที่เกิดขึ้นจริงแต่จะจำกัดไว้สูงสุดไม่เกินจำนวนมูลค่าของสินค้าและบริการซึ่งผู้ใช้ได้ชำระให้แก่บริษัทฯ

# terms12
source: <b>12. Links to External Parties </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>This Service may contain links to other applications, functions, features or other websites, including products and services of third parties (hereinafter referred to as 'Links to External Parties'). These links are provided solely to facilitate the provision of services to users. Links to external parties do not imply that the Company is endorsed, controlled or responsible by the Company. Therefore, the Company cannot guarantee the accuracy, reliability, security of the links, including the results of any actions and is not responsible, directly or indirectly, for any loss or damage suffered by the User from the use and linking to such external parties.
th: <b>12. การเชื่อมโยงไปยังบุคคลภายนอก </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>บริการฯนี้อาจมีการเชื่อมโยงกับแอปพลิเคชันอื่น ฟังก์ชัน (Functions) ฟีเจอร์ (Features) หรือเว็บไซต์อื่นๆ รวมถึงผลิตภัณฑ์และบริการของบุคคลภายนอก (ซึ่งต่อไปนี้เรียกว่า “การเชื่อมโยงไปยังบุคคลภายนอกฯ”) การเชื่อมโยงนี้มีขึ้นเพื่ออำนวยความสะดวกในการให้บริการให้แก่ผู้ใช้เท่านั้น ซึ่งการเชื่อมโยงไปยังบุคคลภายนอกฯ นี้มิได้แสดงว่าบริษัทฯ ได้รับการสนับสนุน หรืออยู่ภายใต้การควบคุม หรือเป็นความรับผิดชอบของบริษัทฯ ดังนั้น บริษัทฯ จึงไม่อาจให้การรับรองในความถูกต้อง ความน่าเชื่อ ความปลอดภัยของการเชื่อมโยง รวมถึงผลลัพธ์ของการดำเนินการใดๆ และไม่รับผิดชอบไม่ว่าโดยตรงหรือโดยอ้อมต่อความสูญหายหรือสูญเสียใดๆ ที่ผู้ใช้ได้รับจากการใช้งานและการเชื่อมโยงไปยังบุคคลภายนอกดังกล่าว

# terms13
source: <b>13. Updating the Software</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>Within a certain period of time, the Company may update, change and perform other actions on the software and/or application of this Service, in which case the User agrees that the Company may do so without prior notice or consent.
th: <b>13. การปรับซอฟต์แวร์ให้เป็นปัจจุบัน </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>ภายในช่วงระยะเวลาใดเวลาหนึ่ง บริษัทฯอาจจะทำการปรับปรุง เปลี่ยนแปลง และกระทำการอื่นใดต่อซอฟต์แวร์และ/หรือแอปพลิเคชันของบริการฯ นี้ ซึ่งผู้ใช้ยินยอมให้บริษัทฯ ดำเนินการดังกล่าวได้โดยไม่จำเป็นต้องให้คำบอกกล่าวหรือขอความยินยอมใดๆ ล่วงหน้า

# terms14
source: <b>14. Advertisement </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>The Company reserves the right to display advertisements for the Company or external parties for users to know through this Service.
th: <b>14. การโฆษณา </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>บริษัทฯ ขอสงวนสิทธิที่จะแสดงโฆษณาสำหรับบริษัทฯ หรือบุคคลภายนอกให้ผู้ใช้ได้รับทราบผ่านทางบริการฯ นี้

# terms15
source: <b>15. Partial Invalidity, Omission and Interpretation </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>In the event that any one or more provisions of these Terms and Conditions shall be held to be invalid or void for any reason whatsoever, such invalidity or voidness shall not affect the validity of the remaining provisions of these Terms and Conditions in any respect, unless otherwise provided in these Terms and Conditions.
th: <b>15. การเป็นโมฆะบางส่วน การละเว้น และ การตีความ </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>ในกรณีที่ข้อกำหนดและเงื่อนไขฯ ข้อใดข้อหนึ่งหรือหลายข้อแห่งข้อกำหนดและเงื่อนไขฯ นี้ตกเป็นอันไม่สมบูรณ์ หรือตกเป็นโมฆะด้วยเหตุใดๆ ก็ตาม ความไม่สมบูรณ์หรือความเป็นโมฆะเช่นว่านี้ จะไม่กระทบกระเทือนถึงความสมบูรณ์ของข้อกำหนดและเงื่อนไขฯ ในส่วนอื่นๆ ไม่ว่าในกรณีใดก็ตาม เว้นแต่ได้ระบุไว้เป็นอื่นในข้อกำหนดและเงื่อนไขฯ นี้

# terms16
source: <b>16. Applicable Law </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>These Terms and Conditions of Service shall be governed by and construed in accordance with the laws of Thailand and the Thai courts shall have exclusive jurisdiction over any disputes that may arise.
th: <b>16. กฎหมายที่บังคับใช้ </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>ข้อกำหนดและเงื่อนไขฯ ของบริการฯ นี้อยู่ภายใต้การบังคับและตีความตามกฎหมายไทย และศาลไทยเป็นผู้มีอำนาจในการพิจารณาข้อพิพาทใดๆ ที่อาจเกิดขึ้น

# terms17
source: <b>17. Notification </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>17.1 When the Company notifies or contacts users about the Services, the Company may use methods that the Company deems appropriate, such as announcing on the Website or Application or any other channels that the Company deems appropriate and is the operator.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>17.2 When users notify or contact the Company about the Services, the users must contact in the formats and methods that the Company has specified on the Website or Application or other methods that the Company has specified and notified only.
th: <b>17. การแจ้งเตือน </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>17.1 เมื่อบริษัทฯ แจ้งหรือติดต่อผู้ใช้เกี่ยวกับบริการฯ บริษัทฯ อาจใช้วิธีการที่บริษัทฯ เห็นว่าเหมาะสม เช่น การประกาศไว้ในเว็บไซต์ หรือแอปพลิเคชัน หรือช่องทางอื่นใดซึ่งบริษัทฯ เห็นว่าเหมาะสมและเป็นผู้ดำเนินการ<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>17.2 เมื่อผู้ใช้แจ้งหรือติดต่อบริษัทฯ เกี่ยวกับบริการฯ ผู้ใช้จะต้องติดต่อในรูปแบบและวิธีการที่บริษัทฯ กำหนดไว้ในเว็บไซต์หรือแอปพลิเคชัน หรือวิธีอื่นๆ ที่บริษัทฯ เป็นผู้กำหนดและแจ้งให้ทราบเท่านั้น

# terms18
source: <b>18. Contact Us</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>In case the user has any questions about the Company's services or terms and conditions, please contact the Company's customer service department at the complaint button in this application or Call Center number 080-076-6145 or Line Official
th: <b>18. ติดต่อเรา </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>ในกรณีที่ผู้ใช้มีข้อสงสัยเกี่ยวกับบริการฯหรือข้อกำหนดและเงื่อนไขฯของบริษัทฯ โปรดติดต่อที่ฝ่ายบริการลูกค้าของบริษัทฯได้ที่ ปุ่มกดแจ้งข้อเรียกร้อง ในแอปพลิเคชันนี้ หรือ Call Center หมายเลข 080-076-6145 หรือ Line Official

# policyDataStart
source: (Effective from 9 September 2023)
th: (เริ่มใช้ตั้งแต่วันที่ 9 กันยายน พ.ศ.2566)

# policyParagraph1
source: <pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>SCG Living and Housing Solution Co., Ltd. (hereinafter referred to as the “Company”) is the service provider of the application named “Smart Living+” which is connected to the Company’s products and services (hereinafter referred to as the “Services”), which facilitates members (hereinafter referred to as “you”) in controlling the operation, viewing the operation status, viewing the operation results of products or services connected to the application, including facilitating the contact of the service provider to request assistance regarding the Company’s products or services.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>The Company respects your privacy rights and to ensure that your personal data (hereinafter referred to as the “Data”) is protected, this Privacy Policy (hereinafter referred to as the “Policy”) has been prepared to inform you of the details related to the collection, use, transfer and disclosure (collectively, “processing”) of your personal data. As required by the Personal Data Protection Act<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>Furthermore, the Company would like to expressly inform you that this Policy is an agreement between you and the Company only, and does not include any partners or other third parties who provide services based on this Service. Therefore, you must carefully study the details of the privacy policies of such partners or third parties before using the Service.
th: <pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>บริษัท เอสซีจี ลีฟวิง แอนด์ เฮาส์ซิง โซลูชัน จำกัด (ต่อไปนี้เรียกว่า “บริษัทฯ”) คือผู้ให้บริการแอปพลิเคชันชื่อ “Smart Living+” ที่เชื่อมต่อกับสินค้าและบริการของบริษัทฯ (ต่อไปนี้เรียกว่า “บริการฯ”) ซึ่งช่วยอำนวยความสะดวกให้แก่สมาชิก (ต่อไปนี้เรียกว่า “ท่าน”) ในการ ควบคุมการทำงาน ดูสถานะการทำงาน ดูผลลัพธ์จากการทำงาน ของสินค้าหรือบริการที่เชื่อมต่อกับแอปพลิเคชัน รวมถึงการอำนวยความสะดวกในการติดต่อผู้ให้บริการเพื่อขอรับความช่วยเหลือเกี่ยวกับสินค้าหรือบริการของบริษัทฯ<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>บริษัทฯ เคารพสิทธิความเป็นส่วนตัวของท่าน และเพื่อให้เกิดความมั่นใจว่าท่านได้รับความคุ้มครองข้อมูลส่วนบุคคล (ซึ่งต่อไปนี้เรียกว่า “ข้อมูลฯ”) จึงได้จัดทำนโยบายความเป็นส่วนตัวฉบับนี้ (ต่อไปนี้เรียกว่า “นโยบายฯ”) เพื่อแจ้งให้ท่านทราบถึงรายละเอียดที่เกี่ยวข้องกับการเก็บรวบรวม การใช้ การส่งต่อ และการเปิดเผย (รวมเรียกว่า “การประมวลผล”) ข้อมูลส่วนบุคคลของท่าน ตามที่กฎหมายคุ้มครองข้อมูลส่วนบุคคลกำหนด<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>อนึ่ง บริษัทฯขอแจ้งให้ท่านทราบโดยชัดแจ้งว่านโยบายฯนี้เป็นข้อตกลงระหว่างท่านและบริษัทฯเท่านั้น มิได้รวมถึงพันธมิตรหรือบุคคลที่สามอื่นใดที่ให้บริการบนพื้นฐานของบริการฯนี้ ดังนั้น ท่านจำเป็นต้องศึกษารายละเอียดนโยบายความเป็นส่วนตัวของพันธมิตรหรือบุคคลที่สามดังกล่าวอย่างรอบคอบก่อนใช้บริการ
