Repository: ujnim/smarthome_101
Catalog: lib/l10n/intl_*.arb
Languages: th

# policy1
source: <b>1. Purpose of processing personal data</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>1.1 To use for creating a member account (Account) and enabling you to access the Company's services, including managing member accounts, obtaining access to new services that may be available in the future, and verifying your identity to request any other services of the Company.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>1.2 For the legitimate interests of the Company or of another person who has legal authority.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(1) To enable the Company to manage, develop and take any action to be able to conduct business, including managing and developing websites and applications, investigating and preventing fraud or other crimes, managing member relationships and potential members Maintaining and using the IT system to suit the needs of service users efficiently.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(2) For security purposes, such as providing security measures, including your personal data, such as limiting access to the Company's data storage locations, logging into websites or applications, etc.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(3) To carry out marketing and sales promotions. And analyze data (Marketing and Data Analysis), including for the benefit of marketing research, such as conducting questionnaires, interviews, etc. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(4) To exercise legal claims related to the Company and/or you <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>1.3 To prevent and suppress dangers to the life, body or health of you or others, such as contacting in an emergency <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>1.4 To be able to comply with the law, such as complying with the provisions of laws, regulations and orders of those with legal authority <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>1.5 To perform duties in the performance of missions for the public benefit of the Company or perform duties in the exercise of the state power that has been granted
th: <b>1. วัตถุประสงค์การประมวลผลข้อมูลส่วนบุคคล</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>1.1 เพื่อใช้ในการสร้างบัญชีสมาชิก (Account) และทำให้ท่านสามารถเข้าถึงบริการฯของบริษัทฯ รวมถึง การจัดการบัญชีสมาชิก การได้รับสิทธิ์เข้าถึงบริการใหม่อันจะมีขึ้นในอนาคต และการยืนยันตัวตนเพื่อขอรับบริการอื่นใดของบริษัทฯ<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>1.2 เพื่อประโยชน์โดยชอบด้วยกฎหมายของบริษัทฯหรือของบุคคลอื่นที่มีอำนาจตามกฎหมาย <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(1) เพื่อให้บริษัทฯสามารถจัดการ พัฒนา และดำเนินการใดๆ เพื่อให้สามารถดำเนินธุรกิจได้ ซึ่งรวมถึงการบริหารจัดการและพัฒนาเว็บไซต์และแอปพลิเคชัน การตรวจสอบและป้องกันการฉ้อโกง หรืออาชญากรรมอื่นๆ การจัดการความสัมพันธ์สมาชิกและผู้ที่อาจเป็นสมาชิก การบำรุงรักษาและการใช้ระบบไอทีให้เหมาะสมกับความต้องการของผู้ใช้บริการอย่างมีประสิทธิภาพ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(2) เพื่อประโยชน์ทางด้านความปลอดภัย เช่น จัดให้มีมาตรการรักษาความปลอดภัย ซึ่งรวมถึงข้อมูลส่วนบุคคลของท่านด้วย เช่น การจำกัดการเข้าถึงสถานที่เก็บข้อมูลฯ ของบริษัทฯ การ Login เข้าเว็บไซต์หรือแอปพลิเคชัน เป็นต้น<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(3) เพื่อดำเนินการทางการตลาด การส่งเสริมการขาย และวิเคราะห์ข้อมูล (Marketing and Data Analysis) รวมถึงเพื่อประโยชน์ในการวิจัยทางการตลาด เช่น ทำแบบสอบถาม เข้าสัมภาษณ์ เป็นต้น <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(4) เพื่อการใช้สิทธิเรียกร้องทางกฎหมายที่เกี่ยวข้องกับบริษัทฯ และ/หรือ ท่าน<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>1.3 เพื่อป้องกันและระงับอันตรายต่อชีวิต ร่างกาย หรือสุขภาพของท่านหรือบุคคลอื่น เช่น การติดต่อในกรณีฉุกเฉิน<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>1.4 เพื่อให้สามารถปฏิบัติตามกฎหมาย เช่น การปฏิบัติตามบทบัญญัติของกฎหมาย กฎระเบียบ และคำสั่งของผู้ที่มีอำนาจตามกฎหมาย <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>1.5 เพื่อการปฏิบัติหน้าที่ในการดำเนินภารกิจเพื่อประโยชน์สาธารณะของบริษัทฯ หรือปฏิบัติหน้าที่ในการใช้อำนาจรัฐที่ได้มอบให้

# policy2
source: <b>2. Privacy Policy for Minors</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>The Company places importance on protecting the privacy of minors. Therefore, persons under the age of 13 must obtain express consent from a legal guardian first.
th: <b>2. นโยบายความเป็นส่วนตัวสำหรับผู้เยาว์ </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>บริษัทฯให้ความสำคัญกับการปกป้องความเป็นส่วนตัวของผู้เยาว์ ดังนั้น บุคคลผู้มีอายุต่ำกว่า 13 ปีบริบูรณ์ ต้องได้รับความยินยอมโดยชัดแจ้งจากผู้ปกครองที่ถูกต้องตามกฎหมายก่อน

# policy3
source: <b>3. Information that the Company receives from you</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>3.1 Information that you provide directly to the Company, as follows <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(1) Information used to identify an individual, including first name, last name, date of birth, photograph<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(2) Information used for contact, including current address, zip code <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(3) Location data (Geolocation) of the residence, including latitude and longitude coordinates.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(4) Any other personal data under applicable privacy laws and necessary that you provide to the Company for the purpose of accessing, using and/or receiving the services via the Application.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>However, if you do not provide the personal data as mentioned above, the Company will not be able to provide the services according to the objectives in Section 1.1 completely.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>3.2 Information that the Company receives when you use the Services As follows:<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(1) Information used to create a user account, including email address, account password, and mobile phone number.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(2) Log information, including information on service access, IP address used, number of times used, language used.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(3) Device Information, including information on the Company's products, mobile phone information or similar communication devices. Both hardware and software versions <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(4) Status information and various operating results that the device detects and sends to your communication device. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(5) Device usage setting information. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(6) Connection signal system information, such as Wi-Fi signal information, signal password. Wi-Fi <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(7) Time zone settings<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>3.3 In necessary cases, if the Company needs to request your Sensitive Data, the Company will request your explicit consent only for the express purposes as required by law. The Company will use its best efforts to provide adequate security measures to protect your Sensitive Data.
th: <b>3. ข้อมูลฯที่บริษัทฯได้รับจากท่าน</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>3.1 ข้อมูลฯที่ท่านมอบให้บริษัทฯโดยตรง ดังนี้ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(1) ข้อมูลที่ใช้ระบุตัวบุคคล ได้แก่ ชื่อจริง นามสกุล วันเดือนปีที่เกิด รูปถ่าย<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(2) ข้อมูลที่ใช้เพื่อการติดต่อ ได้แก่ ที่อยู่ปัจจุบัน รหัสไปรษณีย์ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(3) ข้อมูลพิกัดตำแหน่ง (Geolocation) ของที่พักอาศัย ได้แก่ พิกัดละติจูดและลองจิจูด<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(4) ข้อมูลส่วนบุคคลอื่นใดภายใต้กฎหมายคุ้มครองส่วนบุคคลที่เกี่ยวข้องและจำเป็นที่ท่านมอบให้แก่บริษัทฯ เพื่อวัตถุประสงค์ในการเข้าถึง ใช้ และ/หรือรับบริการผ่านแอปพลิเคชัน<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>ทั้งนี้ หากท่านไม่ได้ให้ข้อมูลส่วนบุคคลตามที่กล่าวข้างต้น บริษัทฯจะไม่สามารถให้บริการตามวัตถุประสงค์ในข้อ 1.1 อย่างสมบูรณ์ได้<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>3.2 ข้อมูลฯที่บริษัทฯได้รับเมื่อท่านใช้บริการฯ ดังนี้ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(1) ข้อมูลที่ใช้สร้างบัญชีผู้ใช้งาน ได้แก่ อีเมล รหัสผ่านของบัญชี และ หมายเลขโทรศัพท์มือถือ<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(2) ข้อมูลการเข้าสู่ระบบ (Log information) ได้แก่ ข้อมูลการเข้าใช้บริการฯ หมายเลข IP ที่เข้าใช้งาน จำนวนครั้งที่ใช้งาน ภาษาที่ใช้ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(3) ข้อมูลของอุปกรณ์ (Device Information) ได้แก่ ข้อมูลสินค้าของบริษัทฯ ข้อมูลโทรศัพท์มือถือหรืออุปกรณ์สื่อสารที่คล้ายกัน ทั้งฮาร์ดแวร์และรุ่นซอฟท์แวร์ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(4) ข้อมูลสถานะ (Status) และ ผลลัพธ์การทำงานต่างๆ ที่อุปกรณ์ตรวจพบ และส่งผ่านมายังอุปกรณ์สื่อสารของท่าน<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(5) ข้อมูลการตั้งค่าการใช้งานอุปกรณ์ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(6) ข้อมูลระบบสัญญาณการเชื่อมต่อ (Connection) เช่น ข้อมูลสัญญาณ Wi-Fi รหัสผ่านสัญญาณ Wi-Fi <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>(7) การตั้งค่าเขตเวลา (Time zone)<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>3.3 ในกรณีที่จำเป็น หากบริษัทฯต้องขอข้อมูลส่วนบุคคลที่มีความอ่อนไหว (Sensitive Data) ของท่าน บริษัทฯจะดำเนินการขอความยินยอมโดยชัดแจ้งจากท่านเพื่อวัตถุประสงค์ที่ชัดเจนตามที่กฎหมายกำหนดไว้เท่านั้น ทั้งนี้ บริษัทฯจะใช้ความพยายามอย่างดีที่สุดในการจัดให้มีมาตรการรักษาความปลอดภัยที่เพียงพอเพื่อปกป้องคุ้มครองข้อมูลส่วนบุคคลที่มีความอ่อนไหวของท่าน

# policy4
source: <b>4. Processing of your personal data</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>The Company may use your data for the following purposes:<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.1 To create and manage your account.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.2 To verify your identity and verify your rights to access the content and various services.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.3 To reserve your rights as requested, such as requesting technical assistance, requesting assistance through the customer relations system, etc.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.4 Used to respond to your comments, inquiries and requests. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.5 Used to secure the Service and prevent misuse, including combating harmful behavior on the Service, detecting and preventing spam and other negative experiences. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.6 Used to monitor and analyze trends, conduct research, and analyze usage and any activities in connection with the Service for evaluation, administration, development, customization of the Service, communications, finance and accounting, development of new products and services, and any other internal administration of the Company. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.7 Used to introduce the Company's or third-party partners' Services, and publicize their content. News or other information that the Company considers may be of interest to you. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.8 Used to invite participation in research, analysis and surveys based on the Service. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.9 Used to link to or merge with information that the Company receives from other sources based on the Service. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.10 Share information to partners in case you have given consent to the policies of each service with the Company's partners, in which case the partners will be responsible for protecting your data in accordance with the standards and laws on personal data protection as well. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.11 Used to inform you of the Terms and Conditions, changed Terms and Conditions, additional Terms and Conditions The changed policies and any other terms and conditions associated with the Services
th: <b>4. การประมวลผลข้อมูลส่วนบุคคลของท่าน</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>บริษัทอาจจะใช้ข้อมูลฯของท่าน เพื่อการดังต่อไปนี้<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.1 ใช้ในการสร้างและจัดการบัญชีของท่าน<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.2 ใช้ในการยืนยันตัวตน และยืนยันสิทธิ์ของท่านในการเข้าถึงเนื้อหาฯ และบริการรูปแบบต่างๆ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.3 ใช้ในการสำรองสิทธิตามที่ท่านร้องขอ เช่น ขอความช่วยเหลือทางด้านเทคนิค การขอความช่วยเหลือผ่านระบบลูกค้าสัมพันธ์ เป็นต้น <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.4 ใช้ในการตอบข้อคิดเห็น ตอบข้อซักถาม และตอบสนองต่อข้อเรียกร้องของท่าน <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.5 ใช้ในการรักษาความปลอดภัยให้กับบริการฯและป้องกันการใช้งานผิดประเภท รวมถึงการต่อต้านพฤติกรรมที่เป็นอันตรายต่อบริการฯ ตรวจจับและป้องกันสแปมและประสบการณ์ที่ไม่ดีอื่นๆ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.6 ใช้ในการสังเกตการณ์และวิเคราะห์แนวโน้ม ทำวิจัย การใช้งานและกิจกรรมใดๆที่เชื่อมโยงกับบริการฯ เพื่อประเมินผล บริหารจัดการ พัฒนา ปรับแต่งการให้บริการฯ การสื่อสาร การเงินและการบัญชี การพัฒนาสินค้าและบริการฯใหม่ และการบริหารงานอื่นใดภายในบริษัทฯ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.7 ใช้ในการแนะนำบริการฯของบริษัทฯหรือบุคคลที่สามที่เป็นพันธมิตร และ ประชาสัมพันธ์เนื้อหา ข่าวสารหรือข้อมูลอื่นใดที่บริษัทฯพิจารณาว่าท่านอาจจะสนใจ<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.8 ใช้ในการเชิญชวนให้เข้าร่วมการทำวิจัย การวิเคราะห์ และการทำแบบสำรวจบนพื้นฐานของบริการฯ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.9 ใช้เชื่อมโยงกับหรือผนวกเข้ากับข้อมูลที่บริษัทฯได้รับจากแหล่งอื่นบนพื้นฐานของบริการฯนี้ <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.10 แบ่งปันข้อมูลฯ ไปยังพันธมิตรกรณีที่ท่านให้ความยินยอมต่อนโยบายฯ ของแต่ละบริการกับพันธมิตรของบริษัทฯ โดยพันธมิตรจะมีหน้าที่ในการคุ้มครองข้อมูลฯ ของท่านตามมาตรฐานและกฎหมายคุ้มครองข้อมูลส่วนบุคคลเช่นกัน <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>4.11 ใช้ประชาสัมพันธ์ให้ท่านรับทราบข้อกำหนดและเงื่อนไขฯ ข้อกำหนดและเงื่อนไขฯที่เปลี่ยนแปลง ข้อกำหนดและเงื่อนไขฯที่เพิ่มเติม นโยบายฯที่เปลี่ยนแปลง และข้อกำหนดอื่นใดที่เชื่อมโยงกับบริการฯ

# policy5
source: <b>5. Withdrawal of consent and possible effects of withdrawal of consent </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>5.1 In the event that the Company collects and processes data based on your consent, you have the right to withdraw your consent given to the Company at any time. Such withdrawal of consent will not affect the collection, use, disclosure or processing of personal data to which you have already consented.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>5.2 If you withdraw your consent given to the Company or refuse to provide certain data, it may result in the Company being unable to carry out some or all of the purposes specified in the Terms and Conditions and this Privacy Policy.
th: <b>5. การถอนความยินยอมและผลกระทบที่เป็นไปได้จากการถอนความยินยอม </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>5.1 ในกรณีที่บริษัทฯเก็บรวบรวมและประมวลผลข้อมูลฯโดยอาศัยความยินยอมของท่าน ท่านมีสิทธิที่จะถอนความยินยอมของท่านที่ให้ไว้กับบริษัทฯได้ตลอดเวลา ซึ่งการถอนความยินยอมนี้จะไม่ส่งผลกระทบต่อการเก็บรวบรวม ใช้ เปิดเผย หรือประมวลผลข้อมูลส่วนบุคคลที่ท่านได้ให้ความยินยอมไปแล้ว<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>5.2 หากท่านถอนความยินยอมที่ได้ให้ไว้กับบริษัทฯหรือปฏิเสธไม่ให้ข้อมูลบางอย่าง อาจส่งผลให้บริษัทฯไม่สามารถดำเนินการเพื่อบรรลุวัตถุประสงค์บางส่วนหรือทั้งหมดตามที่ระบุไว้ในข้อกำหนดและเงื่อนไขฯ และนโยบายความเป็นส่วนตัวนี้ได้

# policy6
source: <b>6. How long does the Company retain your personal data?</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.1 The Company will retain your personal data for the period necessary to achieve the objectives of each type of personal data, unless the law permits a longer retention period. In the event that the retention period of personal data cannot be clearly specified, the Company will retain the data for the period that may be expected according to the standards for collecting business data, which is 5 years and a maximum of 10 years from the date you cancel the service or withdraw your consent.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.2 The Company has an audit system to delete or destroy personal data when the retention period has expired or is irrelevant or unnecessary for the purpose of collecting such personal data. The Company will delete or destroy the data that the Company has collected when the retention period in 6 ends.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.3 In the event that the Company uses your personal data by requesting your consent, the Company will process such personal data until you notify us of your withdrawal of consent and the Company has completed your request. However, the Company will still retain your personal data as necessary for the record of your withdrawal of consent so that the Company can respond to your requests in the future.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.4 You are expressly aware that you may lose some data or content that the Company has not backed up or has deleted. Therefore, you are required to back up the data or content that you have provided to the Company or that the Company has provided to you for your own benefit in the future.
th: <b>6. บริษัทฯเก็บรักษาข้อมูลส่วนบุคคลของท่านนานเท่าไร</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.1 บริษัทฯจะเก็บข้อมูลส่วนบุคคลของท่านในระยะเวลาที่จำเป็นเพื่อให้บรรลุวัตถุประสงค์ตามประเภทข้อมูลส่วนบุคคลแต่ละประเภท เว้นแต่กฎหมายจะอนุญาตให้มีระยะเวลาการเก็บรักษาที่นานขึ้น ในกรณีที่ไม่สามารถระบุระยะเวลาการเก็บรักษาข้อมูลส่วนบุคคลได้ชัดเจน บริษัทฯจะเก็บรักษาข้อมูลไว้ตามระยะเวลาที่อาจคาดหมายได้ตามมาตรฐานของการเก็บรวบรวมข้อมูลทางธุรกิจ คือ 5 ปี และนานที่สุดไม่เกิน 10 ปี นับจากวันที่ท่านยกเลิกการใช้บริการหรือถอนความยินยอม<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.2 บริษัทฯจัดให้มีระบบการตรวจสอบเพื่อดำเนินการลบหรือทำลายข้อมูลส่วนบุคคลเมื่อพ้นกำหนดระยะเวลาการเก็บรักษาหรือที่ไม่เกี่ยวข้องหรือเกินความจำเป็นตามวัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคลนั้น และจะดำเนินการลบหรือทำลายข้อมูลฯ ที่บริษัทเก็บรวบรวมเมื่อสิ้นสุดระยะเวลาการเก็บรักษาตาม 6.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.3 กรณีที่บริษัทฯ ใช้ข้อมูลส่วนบุคคลของท่านโดยขอความยินยอมจากท่าน บริษัทฯ จะประมวลผลข้อมูลส่วนบุคคลดังกล่าวจนกว่าท่านจะแจ้งขอยกเลิกความยินยอมและบริษัทฯ ดำเนินการตามคำขอของท่านเสร็จสิ้นแล้ว อย่างไรก็ดี บริษัทฯจะยังเก็บข้อมูลส่วนบุคคลของท่านเท่าที่จำเป็นสำหรับบันทึกเป็นประวัติว่าท่านเคยยกเลิกความยินยอม เพื่อให้บริษัทฯ สามารถตอบสนองต่อคำขอของท่านในอนาคตได้<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.4 ท่านได้รับทราบโดยชัดแจ้งแล้วว่า ท่านอาจสูญเสียข้อมูลฯหรือเนื้อหาฯ บางส่วนที่บริษัทฯไม่ได้สำรองไว้ หรือถูกลบไปแล้ว ดังนั้น ท่านจำเป็นต้องสำรองข้อมูลฯหรือเนื้อหาฯในส่วนที่ท่านได้มอบให้บริษัทฯหรือในส่วนที่บริษัทฯมอบให้แก่ท่าน เพื่อประโยชน์ของตัวท่านเองในภายหลัง
