Repository: ujnim/smarthome_101
Catalog: lib/l10n/intl_*.arb
Languages: th

# terms5
source: <b>5. Protection of Personal Data</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>5.1 The User acknowledges and agrees that the collection, use and disclosure of the User's personal data for the use of this Service is in accordance with the Company's Personal Data Protection Policy, which describes the nature and methods by which the Company will collect, compile, process, use and disclose personal data, including the User's rights over such personal data.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>5.2 By using this Service, the User acknowledges that he/she must accept and agree to the said Personal Data Protection Policy in all respects.
th: <b>5. การคุ้มครองข้อมูลส่วนบุคคล </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>5.1 ผู้ใช้รับทราบและยอมรับว่า การเก็บรวบรวม การใช้งาน และการเปิดเผยข้อมูลส่วนบุคคลของผู้ใช้ สำหรับการใช้บริการฯ นี้ เป็นไปตามนโยบายคุ้มครองข้อมูลส่วนบุคคลของบริษัทฯ ซึ่งอธิบายถึงลักษณะและวิธีการที่บริษัทฯ จะเก็บ รวมรวม ประมวลผลใช้ และเปิดเผยข้อมูลส่วนบุคคล รวมถึงสิทธิที่ผู้ใช้ที่มีต่อข้อมูลส่วนบุคคลดังกล่าว<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>5.2 โดยการใช้บริการนี้ ผู้ใช้รับทราบว่าจะต้องยอมรับและตกลงตามนโยบายคุ้มครองข้อมูลส่วนบุคคลดังกล่าวทุกประการเรียบร้อยแล้ว

# terms6
source: <b>6. User Accounts </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.1 The User must provide necessary, true, correct and complete information while using the Service, which may include personal information, and must update such information to be current at all times for the effective use of the Service. Creating an account using false information is considered an intentional violation of the Company's terms and conditions, which affects the efficiency of the Service.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.2 The User shall be responsible for keeping the account information and login password confidential and shall not disclose it to anyone. The Company shall consider that each time the User registers for login with the User's account and password, it is an action taken by the User. The User agrees that such action shall be binding on the User in using the Service with the Company. In the event that any expenses or civil liability arises from such actions, the User agrees to be fully responsible for such expenses or responsibilities, unless there is evidence that can be proven that they occurred without the User's consent. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.3 When the user has registered to create an account to use the service, the user can delete his/her account and stop using the service at any time. However, such stop using the service will not affect the user's consent or any actions that the company has taken prior to the stop using the service. <br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.4 The company may suspend or delete the user's account without prior notice if the company sees or believes that the user is violating or has violated these terms and conditions, or the user has done anything that may cause damage to the company, or has used this service or the user's account for or in a business that may be against the law, public order or good morals, or in an unusual manner or there are circumstances that suggest that the service is being used in a way that may cause damage to any person in any way without the right and/or proper reason under the law. Or any other necessary reason as the Company deems appropriate.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.5 The Company reserves the right to delete accounts that have been inactive or inactive for 1 (one) year or more from the date the account was last activated without prior notice to the User.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.6 The User's right to use the Service will terminate from the date the User's account is deleted for whatever reason. Such account cannot be recovered even if the User accidentally deletes his/her account. Therefore, the User should be aware of this and use it with caution.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.7 Each account provided by the Service is for personal use and belongs to the account owner only. Users may not transfer or lend their account to a third party, and a third party may not inherit an account from the User.
th: <b>6. บัญชีผู้ใช้งาน </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.1 ผู้ใช้จำเป็นต้องให้ข้อมูลที่จำเป็น เป็นจริง ถูกต้อง และครบถ้วนในขณะที่ใช้บริการฯ ซึ่งอาจรวมถึงข้อมูลส่วนบุคคลด้วย และต้องปรับปรุงข้อมูลดังกล่าวให้เป็นปัจจุบันอยู่ตลอดเวลาเพื่อการใช้บริการฯ ที่มีประสิทธิภาพ การสร้างบัญชีโดยใช้ข้อมูลที่เป็นเท็จถือเป็นการจงใจละเมิดข้อกำหนดและเงื่อนไขฯของบริษัทฯ ซึ่งมีผลต่อประสิทธภาพของการให้บริการฯ<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.2 ผู้ใช้จะรับผิดชอบในการเก็บรักษาข้อมูลบัญชี รหัสผ่านสำหรับเข้าใช้งานไว้เป็นความลับและจะไม่เปิดเผยให้ผู้ใดทราบ บริษัทฯ จะถือว่าถือว่าการลงทะเบียนเข้าใช้งานด้วยบัญชีและรหัสผ่านของผู้ใช้แต่ละครั้ง เป็นการดำเนินการที่กระทำโดยผู้ใช้เอง โดยผู้ใช้ตกลงที่จะให้การกระทำดังกล่าวมีผลผูกพันผู้ใช้ในการใช้บริการฯ กับทางบริษัทฯ และหากเป็นกรณีที่มีค่าใช้จ่ายหรือความรับผิดทางแพ่งจากการกระทำดังกล่าวเกิดขึ้น ผู้ใช้ตกลงรับผิดชอบค่าใช้จ่ายหรือความรับผิดชอบนั้นเต็มจำนวน ทั้งนี้ เว้นแต่จะมีหลักฐานที่สามารถพิสูจน์ได้ว่าเกิดขึ้นโดยผู้ใช้ไม่ยินยอม และได้ใช้ความระมัดระวังตามสมควรแล้ว<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.3 เมื่อผู้ใช้ลงทะเบียนสร้างบัญชีเพื่อใช้บริการฯแล้ว ผู้ใช้สามารถลบบัญชีของตนและเลิกใช้บริการฯได้ ไม่ว่าเวลาใดก็ตาม ทั้งนี้ การเลิกใช้บริการฯดังกล่าว จะไม่ส่งผลกระทบต่อความยินยอมของผู้ใช้ หรือการดำเนินการใดๆ ที่บริษัทฯ ได้กระทำไปก่อนหน้าการยกเลิกการใช้บริการฯ นั้นแต่อย่างใด<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.4 บริษัทฯอาจระงับหรือลบบัญชีของผู้ใช้โดยไม่ต้องให้คำบอกกล่าวล่วงหน้า หากบริษัทฯเห็นว่าหรือเชื่อว่าผู้ใช้กำลังละเมิดหรือได้ละเมิดข้อกำหนดและเงื่อนไขฯนี้ หรือผู้ใช้กระทำการใดๆ ซึ่งอาจก่อให้เกิดความเสียหายต่อบริษัทฯ หรือมีการใช้บริการฯ นี้หรือใช้บัญชีของผู้ใช้ฯ เพื่อหรือในกิจการที่อาจเป็นการขัดต่อกฎหมาย หรือความสงบเรียบร้อยหรือศีลธรรมอันดีของประชาชน หรือในลักษณะที่ผิดปกติหรือมีพฤติการณ์อันน่าเชื่อว่ามีการใช้บริการฯ อันอาจก่อให้เกิดความเสียหายแก่บุคคลใดๆ ไม่ว่าด้วยประการใดๆ โดยไม่มีสิทธิ และ/หรือเหตุอันสมควรตามกฎหมาย หรือเหตุจำเป็นอื่นใดตามที่บริษัทฯเห็นสมควร<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.5 บริษัทฯสงวนสิทธิที่จะลบบัญชีที่ไม่มีการเปิดใช้งานหรือไม่มีการเคลื่อนไหวเป็นเวลา 1 (หนึ่ง) ปีหรือนานกว่านั้น นับตั้งแต่วันที่มีการเปิดใช้งานบัญชีดังกล่าวครั้งล่าสุด โดยไม่ต้องให้คำบอกกล่าวล่วงหน้าแก่ผู้ใช้<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.6 สิทธิการใช้บริการฯของผู้ใช้จะสิ้นสุดลงนับตั้งแต่วันที่ทำการลบบัญชีของผู้ใช้ด้วยเหตุผลใดก็ตาม บัญชีดังกล่าวจะไม่สามารถกู้คืนมาได้แม้ว่าผู้ใช้จะลบบัญชีของตนโดยไม่ได้ตั้งใจก็ตาม ดังนั้นผู้ใช้ควรตระหนักถึงเรื่องนี้และใช้งานด้วยความระมัดระวัง<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>6.7 บัญชีแต่ละบัญชีที่ให้บริการฯ มีไว้เพื่อการใช้งานเฉพาะบุคคลและเป็นของเจ้าของบัญชีแต่เพียงผู้เดียวเท่านั้น ผู้ใช้ไม่สามารถโอนหรือให้ยืมบัญชีของตนแก่บุคคลที่สาม และบุคคลที่สามไม่สามารถรับช่วงบัญชีจากผู้ใช้ได้

# terms7
source: <b>7. The Company's Services</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.1 The Company is a provider of applications used on mobile phones or other similar electronic devices that work with products or services of the Company, affiliated companies, Siam Cement Public Company Limited and other partner companies (if any), whereby users will receive the following services:<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.1.1 Display the working status or results of the working of products or services connected to the application.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.1.2 Control the operation of products or services connected to the Application.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.1.3 Facilitate contacting the service provider to request assistance regarding products or services.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.2 The Company allows the User to use the Service for the purposes of using the Service specified in Section 7.1 only, on a non-exclusive license basis. The User may not transfer such rights to others (Non-Transferable) or re-license them (Non-Relicensable).<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.3 The User shall be responsible for providing the necessary and appropriate mobile phone equipment, operating system, and data connection signal for using the Service. Including the maintenance of the above equipment to be ready for use at all times, for which the user will be responsible for all expenses.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.4 The Company reserves the right to limit access to all or some of the Services, depending on the conditions that the Company deems necessary, such as the age of the user, identification, etc.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.5 The Company reserves the right to change or terminate all or some of the Services at the Company's discretion at any time without prior notice to the user
th: <b>7. บริการฯ ของบริษัทฯ </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.1 บริษัทฯ เป็นผู้ให้บริการแอปพลิเคชันที่ใช้บนโทรศัพท์มือถือหรืออุปกรณ์อิเล็กทรอนิคส์อื่นใดที่คล้ายกัน ซึ่งทำงานร่วมกับสินค้าหรือบริการของบริษัทฯ บริษัทในเครือ บริษัท ปูนซิเมนต์ไทย จำกัด (มหาชน) และ บริษัทพันธมิตรรายอื่น (หากมี) โดยที่ผู้ใช้จะได้รับบริการดังนี้<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.1.1 แสดงสถานะการทำงานหรือผลลัพธ์จากการทำงานของสินค้าหรือบริการที่เชื่อมต่อกับแอปพลิเคชัน<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.1.2 ควบคุมการทำงานของของสินค้าหรือบริการที่เชื่อมต่อกับแอปพลิเคชัน<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.1.3 อำนวยความสะดวกในการติดต่อผู้ให้บริการเพื่อขอรับความช่วยเหลือเกี่ยวกับสินค้าหรือบริการ<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.2 บริษัทฯอนุญาตให้ผู้ใช้ใช้บริการฯ ตามวัตถุประสงค์ในการใช้บริการที่กำหนดในข้อ 7.1 เท่านั้น โดยเป็นการอนุญาตให้ใช้สิทธิแบบไม่จำกัดจำนวน (Non-Exclusive License) ทั้งนี้ ผู้ใช้จะไม่สามารถโอนสิทธิดังกล่าวไปให้ผู้อื่นได้ (Non-Transferable) หรือไม่สามารถนำไปอนุญาตใหม่ได้ (Non-Relicensable)<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.3 ผู้ใช้จะเป็นผู้รับผิดชอบในการจัดหาอุปกรณ์โทรศัพท์มือถือ ระบบปฏิบัติการ และสัญญาณการเชื่อมต่อข้อมูลที่จำเป็นและเหมาะสมสำหรับการใช้บริการฯ รวมถึงการดูแลรักษาอุปกรณ์ดังกล่าวข้างต้นให้มีความพร้อมใช้งานอยู่เสมอโดยผู้ใช้จะเป็นผู้รับผิดชอบค่าใช้จ่ายเองทั้งสิ้น<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.4 บริษัทฯขอสงวนสิทธิที่จะจำกัดการเข้าถึงบริการฯ ทั้งหมดหรือเพียงบางส่วน ขึ้นอยู่กับเงื่อนไขที่บริษัทฯ เห็นว่าจำเป็น เช่น อายุของผู้ใช้ การระบุตัวตน เป็นต้น<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>7.5 บริษัทฯขอสงวนสิทธิในการเปลี่ยนแปลงหรือยุติบริการฯ ทั้งหมดหรือเพียงบางส่วนตามดุลยพินิจของบริษัทฯ ไม่ว่าในเวลาใดก็ตาม โดยไม่ต้องให้คำบอกกล่าวล่วงหน้าแก่ผู้ใช้

# terms8
source: <b>8. Partner Company Services</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>Content and services that may be offered to users by other partner companies that collaborate with the Company (including but not limited to providers of Solar Roof Solution, Air Quality Solution, Smart Home Solution, Personal Health Care Solution, which may change in the future) may also be included in this Service. The partner companies are solely responsible for their content and/or services offered. In addition, such content and services are subject to separate terms and conditions that the partner companies have set for such content and services. Users must agree to accept such terms and conditions, which may have conditions on the collection, use and disclosure of personal data, including notification of details on the collection of personal data to users that are additional or different from these Terms and Conditions.
th: <b>8. บริการฯของบริษัทพันธมิตร </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>เนื้อหาและบริการที่อาจมีการนำเสนอต่อผู้ใช้โดยบริษัทพันธมิตรรายอื่นที่ร่วมมือกับบริษัทฯ (รวมถึงแต่ไม่จำกัดเพียง ผู้ให้บริการด้าน Solar Roof Solution, Air Quality Solution, Smart Home Solution, Personal Health Care Solution ที่อาจมีการเปลี่ยนแปลงได้ในอนาคต) อาจจะรวมอยู่ภายในบริการฯ นี้ด้วย โดยบริษัทพันธมิตรจะเป็นผู้รับผิดชอบแต่เพียงผู้เดียวเกี่ยวกับเนื้อหาและ/หรือบริการของตนที่นำเสนอดังกล่าว นอกจากนี้ เนื้อหาและบริการดังกล่าวจะอยู่ภายใต้ข้อบังคับของข้อกำหนดและเงื่อนไขที่แยกต่างหากโดยชัดแจ้ง ซึ่งบริษัทพันธมิตรได้กำหนดไว้สำหรับเนื้อหาและบริการนั้นๆ โดยผู้ใช้จะต้องตกลงยอมรับข้อกำหนดและเงื่อนไขดังกล่าว ซึ่งอาจมีเงื่อนไขการเก็บ รวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคล รวมถึงมีการแจ้งรายละเอียดในการเก็บรวบรวมข้อมูลส่วนบุคคลให้ผู้ใช้ทราบเพิ่มเติม หรือแตกต่างจากในข้อกำหนดและเงื่อนไขฯ ฉบับนี้

# terms9
source: <b>9. User's use of the service</b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>The user acknowledges and agrees to accept the Company's terms of service as follows:<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.1 The user shall strictly comply with these terms and conditions, including the service manual that the Company has prepared in the form of a pamphlet or message on the Company's website or in any other form that the Company deems appropriate, which such manual is considered a part of these terms and conditions. The user shall not use the service beyond the scope of use specified by the Company.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.2 The user shall not use the service, in whole or in part, in activities that violate the law, judgments, resolutions or court orders. Or administrative measures that are legally binding.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.3 Users must not use the Service, in whole or in part, in activities that violate public peace or morality.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.4 Users must not use the Service, in whole or in part, in activities that display or forward expressions that are violent or gender-related, expressions that lead to discrimination based on race, nationality, belief, gender, social status, family origin, etc., expressions that encourage or promote suicide, self-harm or drug abuse, or anti-social expressions that contain anti-social content and make others feel uncomfortable.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.5 Users must not use the Service, in whole or in part, in activities that cause others to misunderstand the Company and/or third parties in a negative way. Or intentionally disseminate false information.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.6 Users must not use the Service, in all or in part, in activities that benefit or cooperate with anti-social or terrorist groups.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.7 Users must not use the Service, in all or in part, in activities that exchange the right to use the Service for cash, assets, or other economic benefits without permission from the Company.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.8 Users must not use the Service, in all or in part, in activities that use the Service for sales, marketing, advertising, solicitation, or other commercial purposes, except for purposes approved by the Company.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.9 Users must not use the Service, in all or in part In activities that use the Service for sexual or obscene acts, activities that use the Service for the purpose of meeting people for sex, activities that use the Service for the purpose of harassing or defamating other users, or activities that use the Service for purposes other than the actual purpose of the Service.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.10 Users must not use the Service, in whole or in part, for activities related to religious activities or inviting to join religious groups.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.11 Users must not use the Service, in whole or in part, for activities that lead to the collection, disclosure or provision of personal information of other persons, registered information, user history, or other similar information in an unlawful or inappropriate manner.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.12 Users must not use the Service, in whole or in part, for activities that interfere with the Service's server and/or network system. Activities that misuse the Service by using BOTs or other technical cheating tools, activities that premeditatedly exploit the defects of the Service, activities that make inappropriate inquiries and/or undue claims, and activities that interfere with the Company's Services or the User's use of the Service.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.13 Users must not use the Service, in whole or in part, for activities that assist or promote any activities specified in Sections 9.2 to 9.12.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.14 Users must not use the Service, in whole or in part, for activities that the Company deems inappropriate, which the Company has already notified or may notify in the future.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.15 Users must not copy, reproduce, reverse engineer, Decoding, modifying, creating derivative works, violating intellectual property rights based on the Company's services without the Company's written permission under these Terms and Conditions.<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>Whether the User intentionally or not violates these Terms of Service, the Company shall consider it a violation of the Terms and Conditions, which results in the User's right to use the Service being terminated on the date of such violation, including the Company having the right to claim for actual damages in the event that the Company suffers damages from such violation by the User.
th: <b>9. การใช้บริการของผู้ใช้ </b><br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>ผู้ใช้รับทราบและตกลงยอมรับข้อกำหนดการใช้บริการฯ ของบริษัทฯ ดังนี้<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.1 ผู้ใช้จะปฏิบัติตามข้อกำหนดและเงื่อนไขฯนี้โดยเคร่งครัด รวมถึงคู่มือการใช้บริการฯที่บริษัทฯ ได้จัดเตรียมไว้ให้ในลักษณะแผ่นพับ หรือข้อความบนเว็บไซต์ของบริษัทฯ หรือลักษณะอื่นใดที่บริษัทฯ เห็นสมควร ซึ่งคู่มือดังกล่าวถือเป็นส่วนหนึ่งของข้อกำหนดและเงื่อนไขฯ นี้ โดยผู้ใช้จะไม่ใช้บริการฯ เกินกว่าขอบเขตของการใช้งานที่บริษัทฯ กำหนด<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.2 ผู้ใช้จะต้องไม่ใช้บริการฯทั้งหมดหรือบางส่วน ในกิจกรรมที่ฝ่าฝืนกฎหมาย คำพิพากษา มติหรือคำสั่งศาล หรือมาตรการทางปกครองที่มีผลผูกพันทางกฎหมาย<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.3 ผู้ใช้จะต้องไม่ใช้บริการฯทั้งหมดหรือบางส่วน ในกิจกรรมที่ขัดต่อความสงบเรียบร้อยหรือศีลธรรมอันดีของประชาชน<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.4 ผู้ใช้จะต้องไม่ใช้บริการฯทั้งหมดหรือบางส่วน ในกิจกรรมที่แสดงหรือส่งต่อซึ่งการแสดงออกที่มีลักษณะรุนแรงหรือเกี่ยวกับเพศ การแสดงออกที่นำไปสู่การเลือกปฏิบัติโดยเชื้อชาติ สัญชาติ ความเชื่อ เพศ สถานะทางสังคม ถิ่นกำเนิดครอบครัว และอื่นๆ การแสดงออกที่ชักชวนหรือส่งเสริมการฆ่าตัวตาย พฤติกรรมการทำร้ายตัวเองหรือการใช้ยาในทางที่ผิด หรือการแสดงออกที่ต่อต้านสังคมซึ่งประกอบด้วยเนื้อหาที่ต่อต้านสังคมและทำให้บุคคลอื่นเกิดความไม่สบายใจ<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.5 ผู้ใช้จะต้องไม่ใช้บริการฯทั้งหมดหรือบางส่วน ในกิจกรรมที่ทำให้ผู้อื่นเข้าใจผิดเกี่ยวกับบริษัทฯ และ/หรือ บุคคลภายนอกในทางเสื่อมเสีย หรือจงใจเผยแพร่ข้อมูลเท็จ<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.6 ผู้ใช้จะต้องไม่ใช้บริการฯทั้งหมดหรือบางส่วน ในกิจกรรมที่เป็นประโยชน์หรือให้ความร่วมมือแก่กลุ่มที่ต่อต้านสังคมหรือกลุ่มผู้ก่อการร้าย<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.7 ผู้ใช้จะต้องไม่ใช้บริการฯทั้งหมดหรือบางส่วน ในกิจกรรมที่มีการแลกเปลี่ยนสิทธิการใช้บริการฯ เป็นเงินสด ทรัพย์สินหรือผลประโยชน์ทางเศรษฐกิจอื่นๆ โดยไม่ได้รับอนุญาตจากบริษัทฯ<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.8 ผู้ใช้จะต้องไม่ใช้บริการฯ ทั้งหมดหรือบางส่วน ในกิจกรรมที่มีการใช้บริการเพื่อการขาย การตลาด โฆษณา การชักชวน หรือวัตถุประสงค์ทางการค้าอื่นๆ ยกเว้นวัตถุประสงค์ที่ได้รับความเห็นชอบจากบริษัทฯ<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.9 ผู้ใช้จะต้องไม่ใช้บริการฯทั้งหมดหรือบางส่วน ในกิจกรรมที่มีการใช้บริการเพื่อการกระทำทางเพศหรือการกระทำที่อนาจาร กิจกรรมที่มีการใช้บริการเพื่อวัตถุประสงค์ในการพบบุคคลเพื่อการมีเพศสัมพันธ์ กิจกรรมที่มีการใช้บริการเพื่อวัตถุประสงค์ในการคุกคาม หรือ การหมิ่นประมาทผู้ใช้รายอื่นๆ หรือกิจกรรมที่มีการใช้บริการเพื่อวัตถุประสงค์อื่นๆที่มิใช่วัตถุประสงค์ที่แท้จริงของการให้บริการ<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.10 ผู้ใช้จะต้องไม่ใช้บริการฯทั้งหมดหรือบางส่วน ในกิจกรรมที่เกี่ยวกับกิจกรรมทางศาสนาหรือเชื้อเชิญให้เข้ากลุ่มทางศาสนา<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.11 ผู้ใช้จะต้องไม่ใช้บริการฯทั้งหมดหรือบางส่วน ในกิจกรรมที่นำไปสู่การเก็บรวบรวม การเปิดเผย หรือการให้ข้อมูลส่วนบุคคลของบุคคลอื่น ข้อมูลที่จดทะเบียน ประวัติผู้ใช้ หรือข้อมูลอื่นๆ ในทำนองเดียวกันโดยไม่ชอบด้วยกฎหมายหรือไม่เหมาะสม<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.12 ผู้ใช้จะต้องไม่ใช้บริการฯทั้งหมดหรือบางส่วน ในกิจกรรมที่แทรกแซงเครื่องแม่ข่าย และ/หรือ ระบบเครือข่ายของบริการฯ กิจกรรมซึ่งเป็นการใช้บริการในทางที่ผิดด้วยการใช้บ็อท (BOTs) หรือ เครื่องมือเพื่อการโกงด้วยวิธีทางเทคนิคอื่นๆ กิจกรรมที่ใช้ข้อบกพร่องของบริการโดยไตร่ตรองไว้ก่อน กิจกรรมที่ทำการสอบถามอย่างไม่สมควร และ/หรือสิทธิเรียกร้องที่ไม่ควรได้ และกิจกรรมที่แทรกแซงการให้บริการฯ ของบริษัทฯ หรือการใช้บริการฯ ของผู้ใช้เอง<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.13 ผู้ใช้จะต้องไม่ใช้บริการฯทั้งหมดหรือบางส่วน ในกิจกรรมที่ให้ความช่วยเหลือหรือส่งเสริมกิจกรรมใดๆที่ระบุไว้ในข้อที่ 9.2 ถึงข้อที่ 9.12<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.14 ผู้ใช้จะต้องไม่ใช้บริการฯทั้งหมดหรือบางส่วน ในกิจกรรมที่บริษัทฯเห็นว่าไม่เหมาะสม ซึ่งบริษัทฯ ได้แจ้งให้ทราบแล้ว หรือที่อาจมีการแจ้งให้ทราบต่อไปในอนาคต<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>9.15 ผู้ใช้จะต้องไม่คัดลอก ผลิตซ้ำ ดำเนินการกระทำทางวิศวกรรมย้อนกลับ การแปลรหัสกลับ การดัดแปลง สร้างงานสร้างสรรค์ต่อเนื่อง การละเมิดสิทธิในทรัพย์สินทางปัญญา บนพื้นฐานการให้บริการของบริษัทฯ โดยไม่ได้รับอนุญาตจากบริษัทฯเ ป็นลายลักษณ์อักษรภายใต้ข้อกำหนดและเงื่อนไขฯฉบับนี้<br/><pre>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</pre>การที่ผู้ใช้ละเมิดข้อกำหนดการใช้บริการฯ นี้ด้วยความตั้งใจหรือไม่ก็ตาม บริษัทฯ ถือว่าเป็นการละเมิดข้อกำหนดและเงื่อนไขฯซึ่งเป็นผลให้สิทธิการใช้งานของผู้ใช้สิ้นสุดลง ณ วันที่ได้กระทำการละเมิดนั้น รวมถึงบริษัทฯ มีสิทธิเรียกร้องค่าเสียหายที่เกิดขึ้นตามจริงในกรณีที่บริษัทฯ ได้รับความเสียหายจากการกระทำละเมิดดังกล่าวของผู้ใช้
